{"term":{"code":"202554","description":"Summer 2025 CPS Semester"},"courses":[{"name":"Financial Accounting","term":"202554","courseNumber":"2100","subject":"ACC","description":"Examines the development, objective, and purpose of financial statements. Emphasizes the preparation, analysis, and use of these statements to make operating, financial, and investment decisions. Covers the underlying methods, concepts, principles, and measurement theories. Topics include understanding the operating cycle, receivables, inventories, plant and equipment, intangible assets, liabilities, bonds, ownership, and stockholders’ equity. Special topics include the mathematics of present value theory, calculations, and applications.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20102","seatCapacity":30,"seatRemaining":8,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Chambers, Keisha"},{"crn":"20309","seatCapacity":30,"seatRemaining":24,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Richards Hall","room":"233","days":[4],"startTime":1330,"endTime":1600,"final":false,"finalDate":null}],"faculty":"Burke-Robinso, Mary-Jane"}]},{"name":"Managerial Accounting","term":"202554","courseNumber":"2200","subject":"ACC","description":"Examines the fundamental tools and principles of managerial accounting for decision-making purposes, including planning and control. Covers cost determination, assignment, definition, and behavior. Requires students to prepare management accounting reports and statements for internal decision-making purposes, including the preparation of budgets and contribution margin statements. Topics include job order, process costing, activity-based costing (ABC), inventory techniques, variance analysis, CVP analysis, and budgeting.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20001","seatCapacity":30,"seatRemaining":13,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Volpicelli, Lisa"}]},{"name":"Cost Accounting","term":"202554","courseNumber":"2300","subject":"ACC","description":"Examines the concepts and methodologies useful to understand a cost accounting system for business decision-making, cost control, and performance assessment. Studies cost analysis and explores statistical methods in measuring cost behavior, overhead, and fixed costs. Introduces capital budgeting techniques for equipment replacement and long-term asset management given the relevant range of productive capacity. Compares and analyzes decentralization, segment, and divisional management accounting. Topics include marginal cost relevancy, make-or buy decisions, multiple product cost assignment and production methods, joint costs and by-products, responsibility accounting, activity-based costing, just-in-time cost systems, economic value added, residual income, the balance scorecard, and return on investment techniques.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20334","seatCapacity":30,"seatRemaining":27,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Hogan, John"}]},{"name":"Financial Reporting and Analysis 1","term":"202554","courseNumber":"3201","subject":"ACC","description":"Examines in greater depth the foundational principles, concepts, and measurement theories relating to financial reporting and stewardship. Focuses on the objectives of financial statements for various users such as lenders, investors, and various stakeholder groups. Emphasizes the accounting conceptual framework, including the guidance and standards promulgated by various standards-setting and regulatory bodies. Topics include the measurement, valuation, and disclosure of receivables, inventories, tangible and intangible assets, depreciation methods, revenue-recognition principles, and required footnotes.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20117","seatCapacity":30,"seatRemaining":16,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Arteaga, Ashley"}]},{"name":"Financial Reporting and Analysis 2","term":"202554","courseNumber":"3202","subject":"ACC","description":"Continues the examination in greater depth of the foundational principles, concepts, and measurement theories relating to financial reporting and stewardship. Focuses on the objectives of financial statements for various users such as lenders, investors, and various stakeholder groups. Emphasizes the accounting conceptual framework, including the guidance and standards promulgated by various standards-setting and regulatory bodies. Topics include the measurement, valuation, and disclosure of liabilities, bond obligations, retirement obligations, reconciliation of deferred taxes and required tax disclosures, various corporate ownership interests, stock options, accounting changes, statement of cash flows, and required footnotes.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20058","seatCapacity":30,"seatRemaining":15,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Nelson, Mary"}]},{"name":"Principles of Auditing","term":"202554","courseNumber":"3330","subject":"ACC","description":"Examines audit principles, concepts, and standards relevant to the attest function. Explores the objectives of audited financial statements performed by certified public accountants in compliance with AICPA auditing standards, PCAOB standards and guidelines, and SEC rules and regulations for publicly held companies. Also explores the objectives of audited financial statements and other lower-level services (such as reviews and compilations) performed for privately held nonpublic companies. Topics include ethical and legal liabilities of the auditor, including the independence and skepticism requirement, internal control, audit evidence, audit procedures, audit compliance and substantive testing, statistical sampling, transaction cycle testing, and the role of the audited reports on the efficiency of capital markets.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20176","seatCapacity":30,"seatRemaining":15,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Melaragni, Francis"},{"crn":"20339","seatCapacity":24,"seatRemaining":21,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"89 Broad Street","room":"215","days":[2,4],"startTime":1335,"endTime":1450,"final":false,"finalDate":null}],"faculty":"Joyce, Theodore"}]},{"name":"Principles of Taxation","term":"202554","courseNumber":"3410","subject":"ACC","description":"Covers the objectives and principles of taxation, including the economic policy underlying various tax systems&#8212;property, consumption, value added, federal, and state income tax regimes. Explores the marginal tax structure and studies the component parts of the tax accounting equation in full, including the definitions and terminology described in the U.S. tax code. Emphasizes the tax compliance responsibilities and tax accounting methods and required reporting obligations for individuals, corporations, and various pass-through entities such as partnerships and subchapter S corporations.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20086","seatCapacity":30,"seatRemaining":24,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Russo, Anthony"}]},{"name":"Financial Statement Analysis","term":"202554","courseNumber":"4320","subject":"ACC","description":"Explores the process, tools, principles, and concepts of financial reporting, financial statement analysis, and valuation used by investors and analysts. Covers analysis of financial information and firm-specific data, emphasizing the structure of financial statements. Focuses on use of this data for equity and debt valuation as part of security analysis and portfolio management. Studies analysis of individual investments, focusing on pricing shares of stock and creating valuation models and specific criteria used in lending decisions. Topics include models of intrinsic value; comparison of accrual accounting and discounted cash flow approaches to valuation; analysis of firm profitability, growth, risk analysis, and value generation; and assessment of accounting quality, forecasting earnings and cash flows, pro forma analysis for strategy and planning, and study of nonfinancial metrics.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Writing Intensive"],"sections":[{"crn":"20002","seatCapacity":30,"seatRemaining":17,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Olson, Sven"},{"crn":"20344","seatCapacity":30,"seatRemaining":28,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Hayden Hall","room":"425","days":[1],"startTime":950,"endTime":1220,"final":false,"finalDate":null}],"faculty":"Melaragni, Francis"}]},{"name":"Composite Materials and Applications","term":"202554","courseNumber":"2200","subject":"AVM","description":"Provides a comprehensive training covering fundamental principles, technologies, and applications of composite materials. Offers students an opportunity to gain an understanding of strengthening mechanisms in fiber, particle, metal-matrix, ceramic-matrix, carbon-carbon, and hybrid composites and to learn how to calculate elastic modulus, critical fiber length, and other parameters. Discusses design considerations of aramid-reinforced composites, such as Kevlar, and other composite materials in terms of their applications. Reviews applications of composite materials in aviation, defense, sports, and advanced manufacturing.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20294","seatCapacity":30,"seatRemaining":25,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Forghan, Fariborz"}]},{"name":"Business Operations and Supply Chain","term":"202554","courseNumber":"3500","subject":"AVM","description":"Offers a look at real-world challenges faced in supply chain management. Explores gathering market data on an industry and creating a should cost model. Offers students an opportunity to gain exposure to pricing indices and realize risks that can impact businesses on a day-to-day basis. Uses tools such as SWOT analyses and Porter's Five Forces to promote strategic thinking. Expands into business continuity planning and scenario planning. Witnesses the importance of planning ahead on communication, backup plans, and safety stocks. Students are introduced to supply chain KPIs, prepared for negotiations, and participate in negotiations. Finally, offers students an opportunity to learn the business impacts of choosing to select a new vendor to add to an organization.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20179","seatCapacity":30,"seatRemaining":27,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Green, Edward"}]},{"name":"Hydraulics and Pneumatics","term":"202554","courseNumber":"4250","subject":"AVM","description":"Examines energy transmission based on hydraulics and pneumatics. Introduces basic fluid dynamics and offers students an opportunity to gain basic knowledge of functionality and design of pumps, motors, cylinders, and valves. Studies calculation methods for hydraulic/pneumatic components and systems, as well as basic system principles for control of position, velocity and speed, force and torque, and power. Emphasizes measurement methods in hydraulic and pneumatic systems.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20204","seatCapacity":30,"seatRemaining":27,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Bialiauskaya, Volha"}]},{"name":"Probability Theory and Introductory Statistics","term":"202554","courseNumber":"2010","subject":"ALY","description":"Introduces statistics for data analytics from an analysis-of-data viewpoint. Topics include frequency distributions; measures of location; mean, median, mode; measures of dispersion; variance; graphic presentation; elementary probability; populations and samples; sampling distributions; categorical data; regression and correlation; and analysis of variance. Explores the use of statistical software in data analysis. Emphasizes hands-on application of probability and statistics in SPSS.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20118","seatCapacity":30,"seatRemaining":21,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Shetty, Sudesh"}]},{"name":"Introduction to Programming for Data Analytics","term":"202554","courseNumber":"2100","subject":"ALY","description":"Offers a hands-on first programming course for those with no prior programming experience. Covers basic programming logic and syntax with Python. Students apply Python packages mostly used on data analytics. Offers students an opportunity to learn how to code on the most used language in the job market.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20197","seatCapacity":30,"seatRemaining":13,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Chandrasekaran, Kayalvizhi"}]},{"name":"Generative AI","term":"202554","courseNumber":"2983","subject":"ALY","description":"Discusses contemporary topics in analytics for a rotating variety of industries (nonprofit and for profit). Employs a mix of lectures, cases, and projects. Instructor determines the topics. May be repeated three times for a maximum of 16 semester hours.\r\n    \r\n    \r\n        Section information text:\r\n        Navigates the evolving landscape of generative AI, exploring foundational concepts, key technologies, and the mysteries inside AI's 'black box.' Offers insight into cutting-edge models, explores platforms like ChatGPT and Claude, and introduces the craft of prompt engineering to refine AI-generated results. Delves into the ethical challenges of AI, addressing bias, transparency, and limitations. Offers professionals across analytics, information technology, engineering, biology, healthcare, management, business, and the humanities powerful tools to make informed decisions and create impactful deliverables in an AI-driven future.","maxCredits":4,"minCredits":1,"nupath":[],"sections":[{"crn":"20335","seatCapacity":30,"seatRemaining":22,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Tasker, Benjamin"}]},{"name":"Intermediate Statistics for Data Analytics","term":"202554","courseNumber":"3015","subject":"ALY","description":"Expands upon the earlier introduced statistical approaches. Emphasizes more advanced analysis and multivariate methods. The goal is to provide students with the fundamental data management, review, reengineering, and exploration skills as necessary data analytical competencies.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20310","seatCapacity":30,"seatRemaining":22,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Dimodugno, Mimoza"}]},{"name":"Data Mining","term":"202554","courseNumber":"3040","subject":"ALY","description":"Introduces the theories and tools for data mining techniques such as rule-based learning, decision trees, clustering, and association-rule mining. Also covers interpretation of the mined patterns using visualization techniques. Offers students an opportunity to gain the knowledge and experience to apply modern data-mining techniques for effective large-scale data pattern recognition and insight discovery. Introduces data analysis software—student teams evaluate, analyze, and report data for the methods used and insights discovered during case studies.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20263","seatCapacity":30,"seatRemaining":26,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Ellis, Marcus"}]},{"name":"Analytics Capstone","term":"202554","courseNumber":"4850","subject":"ALY","description":"Offers an advanced practicum in the development and delivery of data analysis for strategic decision making in organizations. Students apply the principles and tools of analytics to a comprehensive real-world problem or project within a sponsoring organization. Expects students to present analytical insights and recommendations for successful implementation of their capstone project.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Capstone Experience"," NUpath Writing Intensive"],"sections":[{"crn":"20286","seatCapacity":30,"seatRemaining":28,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Duvvuri, Venkata"}]},{"name":"MLOps and AI","term":"202554","courseNumber":"4983","subject":"ALY","description":"Discusses contemporary topics in analytics for a rotating variety of industries (nonprofit and for profit). Employs a mix of lectures, cases, and projects. Instructor determines the topics. May be repeated three times for a maximum of 16 semester hours.\n\r\n    \r\n    \r\n        Section information text:\r\n        Examines the Machine Learning Operations (MLOps) lifecycle for designing, deploying, and managing scalable machine learning systems. Surveys emerging trends, such as serverless computing and edge deployments, to illuminate future directions in MLOps. Highlights foundational methods for data ingestion, pipeline orchestration, and performance monitoring while addressing ethical and security considerations. Emphasize cross-functional collaboration between data science and engineering for production-ready solutions that prioritize reliability and reproducibility. Demonstrates how automation strategies and best practices accelerate feedback loops and streamline model updates. Encourages a practice-based approach that integrates experimental results with continuous delivery to align with organizational goals.","maxCredits":4,"minCredits":1,"nupath":[],"sections":[{"crn":"20332","seatCapacity":30,"seatRemaining":23,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Wan, Quan"}]},{"name":"Digital Photography","term":"202554","courseNumber":"1200","subject":"ART","description":"Designed to acquaint the beginner with the use of digital tools to manipulate and create digital imagery. Offers students an opportunity to learn to create a 360-degree panoramic photograph, digital slideshows, photographs for the web, and advanced techniques for negative scanning and advanced RAW file manipulation. Requires weekly assignments, demonstrations, hands-on experience, and a final portfolio. Students must supply their own 4-megapixel or greater camera. Intended as an entry-level course for visual artists and amateur photographers who wish to learn to express themselves using digital imaging.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Creative Express/Innov"],"sections":[{"crn":"20137","seatCapacity":30,"seatRemaining":11,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Neville Ambler, Elisabeth"},{"crn":"20144","seatCapacity":30,"seatRemaining":25,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Neville Ambler, Elisabeth"}]},{"name":"Typography: Communicating Content with Form","term":"202554","courseNumber":"2000","subject":"ART","description":"Offers students an opportunity to obtain an understanding of effects produced by fonts and typographic techniques used in contemporary visual design. Uses computer-based graphic design software to present a historical overview of typography and to explore formal qualities of characters and typefaces through applied projects. Seeks to guide students&#8217; understanding of how successful graphic design that includes letters and words depends on clear and appropriate typography to express and communicate information.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Creative Express/Innov"],"sections":[{"crn":"20244","seatCapacity":30,"seatRemaining":22,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Smith, Gillian"}]},{"name":"Foundation in Visual Communication","term":"202554","courseNumber":"2100","subject":"ART","description":"Offers students an opportunity to gain knowledge of the fundamental elements of 2D design in order to explore the concept of pictorial order and to understand the principles of organization and formal elements of 2D design as communication tools.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Creative Express/Innov"],"sections":[{"crn":"20067","seatCapacity":30,"seatRemaining":12,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Zhou, Lin"}]},{"name":"Principles of Biology 1","term":"202554","courseNumber":"1100","subject":"BIO","description":"Introduces a variety of biological concepts. Surveys plant and animal characteristics by comparing cell structure and function. Examines specific elements of structure, function, and natural history. Specific topics include cytology, histology, physiology, genetics, cellular respiration, and botany.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Natural/Designed World"],"sections":[{"crn":"20004","seatCapacity":24,"seatRemaining":14,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Forsyth Building","room":"128","days":[3],"startTime":1750,"endTime":2020,"final":false,"finalDate":null}],"faculty":"Jensen, Kari"},{"crn":"20164","seatCapacity":30,"seatRemaining":21,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Harari, Joseph"}]},{"name":"Lab for BIO 1100","term":"202554","courseNumber":"1101","subject":"BIO","description":"Accompanies BIO 1100. Studies the specialization of animal cells and ecological succession. Offers students an opportunity to learn about proper experimental design and the limits of experimentation. Includes observing the structure and function of unicellular organisms and the characteristics of biological molecules, measuring aerobic and anaerobic respiration rates, observing cellular reproduction, and genetic analysis of plants and animals.","maxCredits":1,"minCredits":1,"nupath":[],"sections":[{"crn":"20005","seatCapacity":24,"seatRemaining":14,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lab","honors":false,"campus":"Boston","meetingTimes":[{"building":"Forsyth Building","room":"128","days":[3],"startTime":2030,"endTime":2200,"final":false,"finalDate":null}],"faculty":"Jensen, Kari"},{"crn":"20165","seatCapacity":30,"seatRemaining":22,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lab","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Harari, Joseph"}]},{"name":"Principles of Biology 2","term":"202554","courseNumber":"1200","subject":"BIO","description":"Covers the major evolutionary trends leading to complex life forms. Surveys organisms beginning with unicellular algae and leading to basic animal structure and function. Describes the anatomy of each body system as well as physiological processes such as hormonal control, nerve impulse transmission, muscular contraction, and the immune response.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Natural/Designed World"],"sections":[{"crn":"20110","seatCapacity":24,"seatRemaining":10,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Richards Hall","room":"235","days":[4],"startTime":1750,"endTime":2020,"final":false,"finalDate":null}],"faculty":"Martinez, Courtney"}]},{"name":"Lab for BIO 1200","term":"202554","courseNumber":"1201","subject":"BIO","description":"Accompanies BIO 1200. Uses prepared slides and preserved specimens to study the Prostitia and animal kingdoms. Studies the appendicular and axial bones, muscles, blood vessels, urogenical anatomy, and the nervous system.","maxCredits":1,"minCredits":1,"nupath":[],"sections":[{"crn":"20111","seatCapacity":24,"seatRemaining":8,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lab","honors":false,"campus":"Boston","meetingTimes":[{"building":"Behrakis Health Sciences Cntr","room":"615","days":[4],"startTime":2030,"endTime":2200,"final":false,"finalDate":null}],"faculty":"Martinez, Courtney"}]},{"name":"Human Anatomy and Physiology 1","term":"202554","courseNumber":"1600","subject":"BIO","description":"Provides an overview of anatomic terminology and organization of the body. Presents the structure and function of cells and tissues. Includes the anatomy and physiology of the integumentary and musculoskeletal systems, joint structure and function, and the nervous and endocrine systems, including special senses.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Natural/Designed World"],"sections":[{"crn":"20008","seatCapacity":24,"seatRemaining":16,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Ryder Hall","room":"454","days":[2],"startTime":1750,"endTime":2035,"final":false,"finalDate":null}],"faculty":"Moxey, Carl"}]},{"name":"Lab for BIO 1600","term":"202554","courseNumber":"1601","subject":"BIO","description":"Accompanies BIO 1600. Covers a range of topics from the course.","maxCredits":1,"minCredits":1,"nupath":[],"sections":[{"crn":"20009","seatCapacity":24,"seatRemaining":16,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lab","honors":false,"campus":"Boston","meetingTimes":[{"building":"Behrakis Health Sciences Cntr","room":"720","days":[2],"startTime":2050,"endTime":2220,"final":false,"finalDate":null}],"faculty":"Moxey, Carl"}]},{"name":"Human Anatomy and Physiology 2","term":"202554","courseNumber":"1700","subject":"BIO","description":"Covers the structure and function of the cardiovascular system (including the properties of blood, the lymphatic system, and immunity) and the respiratory, digestive, and urogenital systems.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Natural/Designed World"],"sections":[{"crn":"20159","seatCapacity":24,"seatRemaining":14,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Ryder Hall","room":"452","days":[2],"startTime":1750,"endTime":2035,"final":false,"finalDate":null}],"faculty":"Moxey, Carl"}]},{"name":"Lab for BIO 1700","term":"202554","courseNumber":"1701","subject":"BIO","description":"Accompanies BIO 1700. Covers a range of topics from the course.","maxCredits":1,"minCredits":1,"nupath":[],"sections":[{"crn":"20160","seatCapacity":24,"seatRemaining":14,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lab","honors":false,"campus":"Boston","meetingTimes":[{"building":"Behrakis Health Sciences Cntr","room":"720","days":[2],"startTime":2050,"endTime":2220,"final":false,"finalDate":null}],"faculty":"Moxey, Carl"}]},{"name":"Microbiology","term":"202554","courseNumber":"2100","subject":"BIO","description":"Emphasizes the close relationship between the development of technology and science. Compares prokaryotic and eukaryotic cellular morphology and physiology, including bioenergetics, carbohydrate metabolism, and cellular nutrition and growth. Studies viral replication, microbial genetics, bacterial taxonomy, and evolution. Discusses the principles of epidemiology and public health related to food, water, and sewage microbiology and the role of microbes in fermentation and industrial and environmental microbiology.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20185","seatCapacity":24,"seatRemaining":14,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Ryder Hall","room":"452","days":[3],"startTime":1750,"endTime":2020,"final":false,"finalDate":null}],"faculty":"Matrajt, Mariana"}]},{"name":"Lab for BIO 2100","term":"202554","courseNumber":"2101","subject":"BIO","description":"Accompanies BIO 2100.","maxCredits":1,"minCredits":1,"nupath":[],"sections":[{"crn":"20287","seatCapacity":30,"seatRemaining":19,"waitlistCapacity":0,"waitlistRemaining":0,"classType":"Lab","honors":false,"campus":"Boston","meetingTimes":[{"building":"Behrakis Health Sciences Cntr","room":"710","days":[3],"startTime":2030,"endTime":2200,"final":false,"finalDate":null}],"faculty":"Matrajt, Mariana"}]},{"name":"Cell Biology","term":"202554","courseNumber":"2300","subject":"BIO","description":"Introduces the chemical composition and structure of cells and organelles. Focuses on transport processes, cell cycle and cell death, and cytoskeleton and matrix. Includes cellular control systems, including cellular energy supply, action of chemical messengers and regulators, cellular principles of respiration, and photosynthesis.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20010","seatCapacity":30,"seatRemaining":18,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"DeWalt, Gloria"}]},{"name":"Genetics and Molecular Biology","term":"202554","courseNumber":"2500","subject":"BIO","description":"Covers a detailed analysis of the biochemical mechanisms that control the maintenance, expression, and evolution of prokaryotic and eukaryotic genomes. Topics covered in lectures and readings of relevant literature include gene regulation, DNA replication, genetic recombination, and mRNA translation. Emphasizes the logic of experimental design and data analysis.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20130","seatCapacity":24,"seatRemaining":16,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Behrakis Health Sciences Cntr","room":"750","days":[4],"startTime":1750,"endTime":2020,"final":false,"finalDate":null}],"faculty":"Matrajt, Mariana"}]},{"name":"Lab for BIO 2500","term":"202554","courseNumber":"2501","subject":"BIO","description":"Accompanies BIO 2500.","maxCredits":1,"minCredits":1,"nupath":[],"sections":[{"crn":"20131","seatCapacity":24,"seatRemaining":18,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lab","honors":false,"campus":"Boston","meetingTimes":[{"building":"Behrakis Health Sciences Cntr","room":"715","days":[4],"startTime":2030,"endTime":2200,"final":false,"finalDate":null}],"faculty":"Matrajt, Mariana"}]},{"name":"Biochemistry","term":"202554","courseNumber":"3100","subject":"BIO","description":"Covers the fundamental chemistry of biomolecules such as proteins, enzymes, lipids, carbohydrates, and nucleotides. Studies important molecular structures and their role in metabolic cycles. Introduces metabolism and catabolic and anabolic pathways of carbohydrates, lipids, proteins, and nucleotide metabolism. Discusses the importance of nutrition and how it affects metabolic pathways, genetic disorders, and mechanisms of action of various drugs that affect these pathways.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Writing Intensive"],"sections":[{"crn":"20054","seatCapacity":20,"seatRemaining":11,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Ryder Hall","room":"124","days":[2],"startTime":1750,"endTime":2020,"final":false,"finalDate":null}],"faculty":"Belanger, Diana"}]},{"name":"Lab for BIO 3100","term":"202554","courseNumber":"3101","subject":"BIO","description":"Accompanies BIO 3100. Introduces modern research techniques used in biochemistry. Topics include purification and characterization of proteins, kinetic properties of enzymes, isolation of high-molecular-weight DNA, and protein separation; DNA mapping; spectrophotometry; peptide mapping and sequencing; enzyme kinetics; and extraction, separation, and isolation techniques.","maxCredits":1,"minCredits":1,"nupath":[],"sections":[{"crn":"20055","seatCapacity":20,"seatRemaining":11,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lab","honors":false,"campus":"Boston","meetingTimes":[{"building":"Behrakis Health Sciences Cntr","room":"705","days":[2],"startTime":2030,"endTime":2200,"final":false,"finalDate":null}],"faculty":"Belanger, Diana"}]},{"name":"Biotechnology Senior Project","term":"202554","courseNumber":"4850","subject":"BTC","description":"Focuses on an in-depth project in which a student conducts research or produces a product related to the student&#8217;s major field.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Capstone Experience"," NUpath Writing Intensive"],"sections":[{"crn":"20312","seatCapacity":30,"seatRemaining":25,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Seminar","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Harari, Joseph"}]},{"name":"General Chemistry 1","term":"202554","courseNumber":"1100","subject":"CHM","description":"Introduces the principles of chemistry. Topics include basic principles and definitions, stoichiometry, chemical equilibrium, moles, gas laws, atomic structure, periodic relationships, and chemical bonding.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Natural/Designed World"],"sections":[{"crn":"20011","seatCapacity":24,"seatRemaining":17,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Ryder Hall","room":"124","days":[3],"startTime":1750,"endTime":2035,"final":false,"finalDate":null}],"faculty":"Toher, Christopher"},{"crn":"20162","seatCapacity":24,"seatRemaining":14,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Ryder Hall","room":"128","days":[4],"startTime":1750,"endTime":2020,"final":false,"finalDate":null}],"faculty":"Toher, Christopher"}]},{"name":"Lab for CHM 1100","term":"202554","courseNumber":"1101","subject":"CHM","description":"Accompanies CHM 1100. Covers a range of topics from the course.","maxCredits":1,"minCredits":1,"nupath":[],"sections":[{"crn":"20012","seatCapacity":24,"seatRemaining":17,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lab","honors":false,"campus":"Boston","meetingTimes":[{"building":"Boston","room":"DEPT","days":[3],"startTime":2050,"endTime":2220,"final":false,"finalDate":null}],"faculty":"Kugabalasooriar, Jasotha"},{"crn":"20163","seatCapacity":24,"seatRemaining":15,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lab","honors":false,"campus":"Boston","meetingTimes":[{"building":"Boston","room":"DEPT","days":[4],"startTime":2030,"endTime":2200,"final":false,"finalDate":null}],"faculty":"Kugabalasooriar, Jasotha"}]},{"name":"General Chemistry 2","term":"202554","courseNumber":"1200","subject":"CHM","description":"Studies the principles of chemical equilibrium and the rates and mechanisms of chemical reactions. Covers solutions, chemical kinetics, chemical equilibria, chemical thermodynamics, and electrochemistry.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Natural/Designed World"],"sections":[{"crn":"20013","seatCapacity":24,"seatRemaining":20,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Kariotis Hall","room":"209","days":[3],"startTime":1750,"endTime":2035,"final":false,"finalDate":null}],"faculty":"Toher, Christopher"},{"crn":"20081","seatCapacity":24,"seatRemaining":8,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Ryder Hall","room":"128","days":[2],"startTime":1750,"endTime":2020,"final":false,"finalDate":null}],"faculty":"Witten, Edward"}]},{"name":"Lab for CHM 1200","term":"202554","courseNumber":"1201","subject":"CHM","description":"Accompanies CHM 1200. Covers a range of topics from the course, such as measurements of heat transfer, rate and equilibrium constants, acid-base reactions, the properties and uses of buffer systems, and the effects of temperature and catalysts.","maxCredits":1,"minCredits":1,"nupath":[],"sections":[{"crn":"20014","seatCapacity":24,"seatRemaining":20,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lab","honors":false,"campus":"Boston","meetingTimes":[{"building":"Boston","room":"DEPT","days":[3],"startTime":2050,"endTime":2220,"final":false,"finalDate":null}],"faculty":"Kugabalasooriar, Jasotha"},{"crn":"20082","seatCapacity":24,"seatRemaining":7,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lab","honors":false,"campus":"Boston","meetingTimes":[{"building":"Boston","room":"DEPT","days":[2],"startTime":2030,"endTime":2200,"final":false,"finalDate":null}],"faculty":"Kugabalasooriar, Jasotha"}]},{"name":"Organic Chemistry 1","term":"202554","courseNumber":"2110","subject":"CHM","description":"Introduces nomenclature, synthesis, molecular structure and bonding, and reaction mechanisms. Includes chemistry of hydrocarbons and their functional derivatives, stereochemical relationships and nucleophilic substitutions, and elimination reactions.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20015","seatCapacity":24,"seatRemaining":0,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Ryder Hall","room":"126","days":[2],"startTime":1750,"endTime":2035,"final":false,"finalDate":null}],"faculty":"Grenier, Casey"},{"crn":"20099","seatCapacity":24,"seatRemaining":17,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Ryder Hall","room":"128","days":[3],"startTime":1750,"endTime":2020,"final":false,"finalDate":null}],"faculty":"Kugabalasooriar, Sanga"}]},{"name":"Lab for CHM 2110","term":"202554","courseNumber":"2111","subject":"CHM","description":"Accompanies CHM 2110. Introduces basic laboratory techniques, such as distillation, crystallization, extraction, chromatography, characterization by physical methods, and measurement of optical rotation, which serve as the foundation for the synthesis, purification, and characterization of products from microscale syntheses.","maxCredits":1,"minCredits":1,"nupath":[],"sections":[{"crn":"20016","seatCapacity":24,"seatRemaining":4,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lab","honors":false,"campus":"Boston","meetingTimes":[{"building":"Boston","room":"DEPT","days":[2],"startTime":2050,"endTime":2220,"final":false,"finalDate":null}],"faculty":"Grenier, Casey"},{"crn":"20098","seatCapacity":24,"seatRemaining":16,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lab","honors":false,"campus":"Boston","meetingTimes":[{"building":"Boston","room":"DEPT","days":[3],"startTime":2030,"endTime":2120,"final":false,"finalDate":null}],"faculty":"Kugabalasooriar, Sanga"}]},{"name":"Organic Chemistry 2","term":"202554","courseNumber":"2200","subject":"CHM","description":"Continues CHM 2110. Focuses on additional functional group chemistry, including alcohols, ethers, carbonyl compounds, amines, and the molecules of nature. Introduces spectroscopic methods for structural identification.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20017","seatCapacity":24,"seatRemaining":5,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Ryder Hall","room":"126","days":[2],"startTime":1750,"endTime":2035,"final":false,"finalDate":null}],"faculty":"Grenier, Casey"},{"crn":"20083","seatCapacity":24,"seatRemaining":10,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Ryder Hall","room":"128","days":[1],"startTime":1750,"endTime":2020,"final":false,"finalDate":null}],"faculty":"Kugabalasooriar, Sanga"}]},{"name":"Lab for CHM 2200","term":"202554","courseNumber":"2201","subject":"CHM","description":"Accompanies CHM 2200. Applies basic laboratory techniques from CHM 2111 to chemical reactions of alcohols, ethers, carbonyl compounds, carbohydrates, and amines. Introduces basic laboratory techniques and instruments for the structural analysis of organic molecules.","maxCredits":1,"minCredits":1,"nupath":[],"sections":[{"crn":"20018","seatCapacity":24,"seatRemaining":5,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lab","honors":false,"campus":"Boston","meetingTimes":[{"building":"Boston","room":"DEPT","days":[2],"startTime":2050,"endTime":2220,"final":false,"finalDate":null}],"faculty":"Grenier, Casey"},{"crn":"20084","seatCapacity":24,"seatRemaining":14,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lab","honors":false,"campus":"Boston","meetingTimes":[{"building":"Boston","room":"DEPT","days":[1],"startTime":2030,"endTime":2200,"final":false,"finalDate":null}],"faculty":"Kugabalasooriar, Sanga"}]},{"name":"Organizational Communication","term":"202554","courseNumber":"1100","subject":"CMN","description":"Introduces psychological, sociological, and communication theories as they apply to organizational life. Offers students an opportunity to analyze the importance of effective communication for organizations in a rapidly changing environment. Topics include management and leadership, culture and change, diversity, conflict management, and employee engagement. Throughout the course, students are encouraged to examine their communication skills in the context of those competencies necessary in today’s complex organizational environments.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Difference/Diversity"," NUpath Interpreting Culture"],"sections":[{"crn":"20091","seatCapacity":30,"seatRemaining":11,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Barrett, Janice"},{"crn":"20132","seatCapacity":30,"seatRemaining":0,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Barrett, Janice"},{"crn":"20153","seatCapacity":30,"seatRemaining":21,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Lisoski, Edward"}]},{"name":"Professional Speaking","term":"202554","courseNumber":"2310","subject":"CMN","description":"Emphasizes the practical skill of public speaking, including methods for overcoming presentation anxiety, and the use of visual aids to enhance speaker presentations. Offers students an opportunity to prepare for a variety of typical public speaking situations and to learn the basic principles of organization and research needed for effective message design and delivery.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20019","seatCapacity":30,"seatRemaining":22,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Cote, Michael"}]},{"name":"Negotiation","term":"202554","courseNumber":"3100","subject":"CMN","description":"Introduces the techniques of dispute resolution. Focuses on the processes of mediation, facilitation, and negotiation. Through readings, lectures, and class activities, offers students an opportunity to explore methods of applying these skills to professional settings.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20020","seatCapacity":30,"seatRemaining":19,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Findley, Charles"}]},{"name":"Intercultural Communication","term":"202554","courseNumber":"3350","subject":"CMN","description":"Focuses on gaining an advanced understanding of the concepts associated with culture and communication. Offers students an opportunity to develop intercultural awareness and patterns of perception and thinking to enable effective communication across cultural boundaries. Discusses the effect of cultural differences on communication styles, personal identities, and various organizational contexts.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20108","seatCapacity":30,"seatRemaining":15,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Brunnquell, Claudine"}]},{"name":"Capstone in Professional Communication","term":"202554","courseNumber":"4850","subject":"CMN","description":"Seeks to guide students in developing a semester-length service-learning project that integrates theory, practice, creativity, and reflection explored throughout their communication studies. The project helps students deepen knowledge and extend ability within their chosen concentrations by having them analyze and apply what they have learned in pragmatic ways that enhance the learning experience, teach civic responsibility, and strengthen communities. Offers students an opportunity to create a portfolio of meaningful artifacts useful for career entry, development, and advancement in this writing-intensive course.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Capstone Experience"," NUpath Integration Experience"," NUpath Writing Intensive"],"sections":[{"crn":"20351","seatCapacity":10,"seatRemaining":8,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Seminar","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Goodman Hayward, Patricia"}]},{"name":"Project","term":"202554","courseNumber":"4955","subject":"CMN","description":"Focuses on in-depth project in which a student conducts research or produces a product related to the student&#8217;s major field. May be repeated without limit.","maxCredits":4,"minCredits":1,"nupath":[],"sections":[{"crn":"20352","seatCapacity":5,"seatRemaining":3,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Individual Instruction","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Goodman Hayward, Patricia"}]},{"name":"Data Structures and Algorithms","term":"202554","courseNumber":"2200","subject":"CET","description":"Covers the design, analysis, and implementation of data structures and algorithms to solve engineering problems using an object-oriented programming language. Topics include elementary data structures (including arrays, stacks, queues, and lists); advanced data structures (including trees and graphs); the algorithms used to manipulate these structures; and their application to solving practical engineering problems.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20259","seatCapacity":30,"seatRemaining":24,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Meesala, Dinesh"}]},{"name":"Computer Networking and Communications Technology","term":"202554","courseNumber":"3100","subject":"CET","description":"Covers the technical foundation for designing, installing, maintaining, and monitoring computer networks. Covers technologies, protocols, and techniques used to connect computers to other computers and hardware components. Topics include the Open Systems Interconnection network model (OSI), internet protocols (TCP/IP), the User Datagram Protocol (UDP), Local Area Networks (LANs) and Wide Area Networks (WANs), wireless networks, network security, virtual private networking, and network management. Covers both circuit-switched and IP-based communications.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20212","seatCapacity":30,"seatRemaining":28,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Arzoughi, Fatema-Ros"}]},{"name":"Object-Oriented Design","term":"202554","courseNumber":"5004","subject":"CS","description":"Presents a comparative approach to object-oriented programming and design. Discusses the concepts of object, class, metaclass, message, method, inheritance, and genericity. Reviews forms of polymorphism in object-oriented languages. Contrasts the use of inheritance and composition as dual techniques for software reuse&#8212;forwarding vs. delegation and subclassing vs. subtyping. Offers students an opportunity to obtain a deeper understanding of the principles of object-oriented programming and design, including software components, object-oriented design patterns, and the use of graphical design notations such as UML (unified modeling language). Illustrates basic concepts in object-oriented design with case studies in application frameworks and by writing programs in Java.","maxCredits":4,"minCredits":4,"nupath":[],"sections":[{"crn":"20313","seatCapacity":4,"seatRemaining":1,"waitlistCapacity":0,"waitlistRemaining":0,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Richards Hall","room":"227","days":[4],"startTime":1800,"endTime":2120,"final":false,"finalDate":null}],"faculty":"Mihajlovikj, Vidoje"},{"crn":"20315","seatCapacity":4,"seatRemaining":3,"waitlistCapacity":0,"waitlistRemaining":0,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Thomas, Jack"}]},{"name":"Recitation for CS 5004","term":"202554","courseNumber":"5005","subject":"CS","description":"Provides small-group discussion format to cover material in CS 5004.","maxCredits":0,"minCredits":0,"nupath":[],"sections":[{"crn":"20314","seatCapacity":4,"seatRemaining":1,"waitlistCapacity":0,"waitlistRemaining":0,"classType":"Recitation/Discussion","honors":false,"campus":"Boston","meetingTimes":[{"building":"Richards Hall","room":"227","days":[2],"startTime":1600,"endTime":1930,"final":false,"finalDate":null}],"faculty":"Mihajlovikj, Vidoje"},{"crn":"20316","seatCapacity":4,"seatRemaining":3,"waitlistCapacity":0,"waitlistRemaining":0,"classType":"Recitation/Discussion","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Thomas, Jack"}]},{"name":"Data Structures, Algorithms, and Their Applications within Computer Systems","term":"202554","courseNumber":"5008","subject":"CS","description":"Presents an integrated approach to the study of data structures, algorithms, and their application within systems topics. Introduces a variety of fundamental algorithmic techniques (divide-and-conquer, dynamic programming, graph algorithms) and systems topics (models of computation, computer architecture, compilation, system software, networking). Demonstrates the integration of topics through programming assignments in the C language that implement fundamental data structures (lists, queues, trees, maps, graphs) and algorithms as they are applied in computer systems. Additional breadth topics include programming applications that expose students to primitives of different subsystems using threads and sockets.","maxCredits":4,"minCredits":4,"nupath":[],"sections":[{"crn":"20317","seatCapacity":3,"seatRemaining":0,"waitlistCapacity":0,"waitlistRemaining":0,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"Virtual Space- Online class","room":"ROOM","days":[2],"startTime":1900,"endTime":2220,"final":false,"finalDate":null}],"faculty":"Lionelle, Albert"},{"crn":"20320","seatCapacity":2,"seatRemaining":1,"waitlistCapacity":0,"waitlistRemaining":0,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Richards Hall","room":"227","days":[3],"startTime":1800,"endTime":2120,"final":false,"finalDate":null}],"faculty":"Mihajlovikj, Vidoje"}]},{"name":"Recitation for CS 5008","term":"202554","courseNumber":"5009","subject":"CS","description":"Provides small-group active learning format to augment material in CS 5008.","maxCredits":0,"minCredits":0,"nupath":[],"sections":[{"crn":"20318","seatCapacity":3,"seatRemaining":0,"waitlistCapacity":0,"waitlistRemaining":0,"classType":"Recitation/Discussion","honors":false,"campus":"Online","meetingTimes":[{"building":"Virtual Space- Online class","room":"ROOM","days":[3],"startTime":1930,"endTime":2100,"final":false,"finalDate":null}],"faculty":"Lionelle, Albert"},{"crn":"20321","seatCapacity":2,"seatRemaining":1,"waitlistCapacity":0,"waitlistRemaining":0,"classType":"Recitation/Discussion","honors":false,"campus":"Boston","meetingTimes":[{"building":"Richards Hall","room":"227","days":[1],"startTime":1800,"endTime":1930,"final":false,"finalDate":null}],"faculty":"Mihajlovikj, Vidoje"}]},{"name":"Database Management Systems","term":"202554","courseNumber":"5200","subject":"CS","description":"Introduces relational database management systems as a class of software systems. Prepares students to be sophisticated users of database management systems. Covers design theory, query language, and performance/tuning issues. Topics include relational algebra, SQL, stored procedures, user-defined functions, cursors, embedded SQL programs, client-server interfaces, entity-relationship diagrams, normalization, B-trees, concurrency, transactions, database security, constraints, object-relational DBMSs, and specialized engines such as spatial, text, XML conversion, and time series. Includes exercises using a commercial relational or object-relational database management system.","maxCredits":4,"minCredits":4,"nupath":[" NUpath Analyzing/Using Data"],"sections":[{"crn":"20347","seatCapacity":1,"seatRemaining":0,"waitlistCapacity":0,"waitlistRemaining":0,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Schedlbauer, Martin"}]},{"name":"Mobile Application Development","term":"202554","courseNumber":"5520","subject":"CS","description":"Focuses on mobile application development on a mobile phone or related platform. Discusses memory management; user interface building, including both MVC principles and specific tools; touch events; data handling, including core data, SQL, XML, and JSON; network techniques and URL loading; and, finally, specifics such as GPS and motion sensing that may be dependent on the particular mobile platform. Students are expected to work on a project that produces a professional-quality mobile application and to demonstrate the application that they have developed. The instructor chooses a modern mobile platform to be used in the course.","maxCredits":4,"minCredits":4,"nupath":[],"sections":[{"crn":"20348","seatCapacity":1,"seatRemaining":0,"waitlistCapacity":0,"waitlistRemaining":0,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Feinberg, Daniel"}]},{"name":"Algorithms","term":"202554","courseNumber":"5800","subject":"CS","description":"Presents the mathematical techniques used for the design and analysis of computer algorithms. Focuses on algorithmic design paradigms and techniques for analyzing the correctness, time, and space complexity of algorithms. Topics may include asymptotic notation, recurrences, loop invariants, Hoare triples, sorting and searching, advanced data structures, lower bounds, hashing, greedy algorithms, dynamic programming, graph algorithms, and NP-completeness.","maxCredits":4,"minCredits":4,"nupath":[" NUpath Formal/Quant Reasoning"],"sections":[{"crn":"20319","seatCapacity":2,"seatRemaining":1,"waitlistCapacity":0,"waitlistRemaining":0,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Stern, Jesse"}]},{"name":"Principles of Microeconomics","term":"202554","courseNumber":"1100","subject":"ECN","description":"Focuses on the development of the basic theory of supply and demand and market prices, as well as competition and monopoly and income distribution. Applies economic principles to selected problems such as poverty, pollution, and international trade.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20021","seatCapacity":30,"seatRemaining":15,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Ozyurt, Kazim"}]},{"name":"Principles of Macroeconomics","term":"202554","courseNumber":"1200","subject":"ECN","description":"Introduces macroeconomics, the study of the economy as a whole. Macroeconomics applies the basic principles of economics to whole economic systems and the relationships among sectors of the economy. Topics include unemployment, inflation, national income and employment theory, government expenditures and taxation, the role of the banking system, and monetary and fiscal policies. Emphasizes the development of conceptual tools to analyze the economic problems facing modern society.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Societies/Institutions"],"sections":[{"crn":"20151","seatCapacity":30,"seatRemaining":6,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Tafoya, Benedict"}]},{"name":"Circuits AC/DC","term":"202554","courseNumber":"2005","subject":"EET","description":"Covers the design and analysis of practical DC and AC circuits. DC-related topics include basic concepts; resistors; capacitors; inductors; series and parallel circuits; theorems of Norton and Thevinin; Ohm's law; Kirchhoff's laws; transient analysis of RL, RC, and RLC circuits; power and energy; power sources; and SPICE circuit simulation. AC topics include network theorems; phasors; sinusoidal sources; steady-state analysis; steady-state power; impedance; admittance and frequency response; resonance; Bode plots; average, reactive, and complex power; and SPICE circuits simulation.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20270","seatCapacity":30,"seatRemaining":26,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Giumarra, James"}]},{"name":"Electronics 1","term":"202554","courseNumber":"3100","subject":"EET","description":"Covers the theory and practical uses of active semiconductors. Topics include the operating characteristics of diodes, field-effect transistors, bipolar junction transistors, MOS transistors, and op amps; the analysis and design of single-stage amplifiers, diode circuits, and transistor circuits; rectifier circuits, clamping and clipping circuits, voltage multipliers, Zener regulators, temperature measuring, discrete amplifiers, feedback, basic op amp circuits, and switching circuits. SPICE is used to simulate circuits.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20296","seatCapacity":30,"seatRemaining":27,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Yaqoob, Zahid"}]},{"name":"Lab for EET 3100","term":"202554","courseNumber":"3101","subject":"EET","description":"Accompanies EET 3100. Covers topics from the course through various experiments.","maxCredits":2,"minCredits":2,"nupath":[],"sections":[{"crn":"20297","seatCapacity":24,"seatRemaining":23,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lab","honors":false,"campus":"Boston","meetingTimes":[{"building":"89 Broad Street","room":"216","days":[4],"startTime":1750,"endTime":1950,"final":false,"finalDate":null}],"faculty":"Yaqoob, Zahid"}]},{"name":"Digital Logic","term":"202554","courseNumber":"3300","subject":"EET","description":"Covers the design, analysis, and simulation of digital circuits. Topics include number systems, Boolean algebra, logic gates, combinational logic, circuit simplification, multiplexers, demultiplexers, encoders, decoders, latches, flip-flops, registers, counters, synchronous sequential circuits, and read-only (ROM) and random-access memory (RAM). Includes digital logic circuitry based on RTL, TTL, ECL, and CMOS logic families and the simulation of digital circuits using a hardware description language.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20298","seatCapacity":30,"seatRemaining":28,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Giumarra, James"}]},{"name":"College Writing 1","term":"202554","courseNumber":"1105","subject":"ENG","description":"Offers students an opportunity to develop written communication skills and basic research techniques in preparation for college writing in their majors. Incorporates reading, research, and critical thinking in the development of expository writing, the kind of objective, audience-directed prose used in college and the workplace to explain and defend ideas. Emphasizes planning, drafting, revising, and correct citation in essays, along with development of focus, organization, and paragraph/sentence structure. Offers opportunities for in-class assignments and peer-review activities in addition to extended essays developed outside of class. Students must pass with a C or higher in order to receive credit and continue to ENG 1107.","maxCredits":3,"minCredits":3,"nupath":[" NU Core/NUpath 1st Yr Writing"],"sections":[{"crn":"20192","seatCapacity":20,"seatRemaining":0,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Yurchak, Nicole"}]},{"name":"Lab for ENG 1105","term":"202554","courseNumber":"1106","subject":"ENG","description":"Requires students to analyze and draft writing assignments from topics covered in ENG 1105.","maxCredits":1,"minCredits":1,"nupath":[],"sections":[{"crn":"20193","seatCapacity":20,"seatRemaining":0,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lab","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"TBA"}]},{"name":"College Writing 2","term":"202554","courseNumber":"1107","subject":"ENG","description":"Builds on students&#8217; skills of written communication and basic research in preparation for college writing in their majors. Offers opportunities to emulate and incorporate various rhetorical strategies in the development of written analysis and researched argumentation. Focuses on techniques for logical analysis (inductive and deductive reasoning) and effective reasoning, establishing credibility, and emotional appeals to develop persuasive arguments. Emphasizes planning, drafting, revising, and correct citation in essays. Offers opportunities for in-class assignments and peer-review activities in addition to extended essays developed outside of class. Students must pass with a C or higher in order to receive credit and continue to ENG 3105 or ENG 3107.","maxCredits":3,"minCredits":3,"nupath":[" NU Core/NUpath 1st Yr Writing"],"sections":[{"crn":"20094","seatCapacity":20,"seatRemaining":17,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Kariotis Hall","room":"104","days":[2],"startTime":1750,"endTime":2020,"final":false,"finalDate":null}],"faculty":"Boozang, William"},{"crn":"20022","seatCapacity":20,"seatRemaining":0,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Desrosiers, Karen"},{"crn":"20299","seatCapacity":20,"seatRemaining":14,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Baker, Julie"}]},{"name":"Lab for ENG 1107","term":"202554","courseNumber":"1108","subject":"ENG","description":"Requires students to analyze and draft writing assignments from topics covered in ENG 1107.","maxCredits":1,"minCredits":1,"nupath":[],"sections":[{"crn":"20095","seatCapacity":20,"seatRemaining":17,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lab","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"TBA"},{"crn":"20023","seatCapacity":20,"seatRemaining":0,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lab","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"TBA"},{"crn":"20300","seatCapacity":20,"seatRemaining":14,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lab","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"TBA"}]},{"name":"Writing for the Professions: Science and Engineering","term":"202554","courseNumber":"3105","subject":"ENG","description":"Offers writing instruction for students considering careers or advanced study in fields of science, technology, engineering, and mathematics. Students practice and reflect on writing in professional, public, and academic genres as they plan, research, write, and analyze various forms of technical communications such as technical reports, progress reports, proposals, instructions, presentations, and technical reviews relevant to technical professions and individual student goals. Offers students opportunities to evaluate a wide variety of sources and to develop communication skills in audience analysis, critical research, peer review, and revision. Students must pass with a C or higher in order to receive credit.","maxCredits":3,"minCredits":3,"nupath":[" NU Core/NUpath Adv Writ Dscpl"],"sections":[{"crn":"20024","seatCapacity":20,"seatRemaining":18,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Kariotis Hall","room":"104","days":[3],"startTime":1750,"endTime":2020,"final":false,"finalDate":null}],"faculty":"Boozang, William"},{"crn":"20100","seatCapacity":20,"seatRemaining":1,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Costagliola, Diane"},{"crn":"20340","seatCapacity":20,"seatRemaining":16,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Murphy Hunt, Brett"}]},{"name":"Lab for ENG 3105","term":"202554","courseNumber":"3106","subject":"ENG","description":"Requires students to analyze and draft writing assignments from topics covered in ENG 3105. Coreq ENG 3105.","maxCredits":1,"minCredits":1,"nupath":[],"sections":[{"crn":"20025","seatCapacity":20,"seatRemaining":18,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lab","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"TBA"},{"crn":"20101","seatCapacity":20,"seatRemaining":1,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lab","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"TBA"},{"crn":"20341","seatCapacity":20,"seatRemaining":16,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lab","honors":false,"campus":"Online","meetingTimes":[],"faculty":"TBA"}]},{"name":"Writing for the Professions: Business and the Social Sciences","term":"202554","courseNumber":"3107","subject":"ENG","description":"Offers writing instruction for students considering careers or advanced study in business administration and the social sciences. Students practice and reflect on writing in professional, public, and academic genres as they plan, research, write, and analyze various forms of business communications such as proposals, recommendation reports, letters, presentations, and emails relevant to industry. Offers students opportunities to evaluate a wide variety of sources and to develop communication skills in audience analysis, critical research, peer review, and revision. Students must pass with a C or higher in order to receive credit.","maxCredits":3,"minCredits":3,"nupath":[" NU Core/NUpath Adv Writ Dscpl"],"sections":[{"crn":"20026","seatCapacity":20,"seatRemaining":0,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Svokos, Grazia"},{"crn":"20096","seatCapacity":20,"seatRemaining":5,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Mahoney, Rebecca"},{"crn":"20059","seatCapacity":20,"seatRemaining":13,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Snell Library","room":"009","days":[4],"startTime":1750,"endTime":2020,"final":false,"finalDate":null}],"faculty":"Brooks, Melanie"}]},{"name":"Lab for ENG 3107","term":"202554","courseNumber":"3108","subject":"ENG","description":"Requires students to analyze and draft writing assignments from topics covered in ENG 3107. Coreq ENG 3107.","maxCredits":1,"minCredits":1,"nupath":[],"sections":[{"crn":"20027","seatCapacity":20,"seatRemaining":0,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lab","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"TBA"},{"crn":"20097","seatCapacity":20,"seatRemaining":5,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lab","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"TBA"},{"crn":"20064","seatCapacity":20,"seatRemaining":13,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lab","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"TBA"}]},{"name":"Writing Poetry","term":"202554","courseNumber":"3220","subject":"ENG","description":"Introduces techniques and styles of poetry. Focuses on fundamentals and philosophy of poetry, including rhythm, rhyme, line breaks, and originality. Examines the roles of audience, speaker, and message in poetry with an emphasis on historically marginalized and under-represented voices. Class discussion emphasizes the role of the literary journal in 21st-century poetry and media. Offers students an opportunity to develop insights grounded in the reading, sharing, and analysis of current poetry published in literary journals/magazines to determine their place in the poetry community as creators, consumers, and/or curators. Students define poetry and its role in their life; craft, revise, and polish their original poems; critique their work and the work of others in discussion boards; and explore avenues for publication.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Creative Express/Innov"],"sections":[{"crn":"20028","seatCapacity":30,"seatRemaining":26,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Fienberg, Ori"}]},{"name":"Writing to Inform and Persuade","term":"202554","courseNumber":"3260","subject":"ENG","description":"Focuses on techniques used in nonfiction writing to communicate ideas and influence audience point of view about &#8220;true&#8221; events or affairs. Examines a variety of nonfiction pieces and styles, such as journalism features and profiles, editorials and opinion pieces, literary essays, and visual arguments. Offers students an opportunity to advance their understanding and appreciation of informative, persuasive writing techniques as they discuss, develop, revise, and review each other&#8217;s original nonfiction pieces.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Writing Intensive"],"sections":[{"crn":"20353","seatCapacity":30,"seatRemaining":28,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[],"faculty":"TBA"}]},{"name":"Introduction to Corporate Finance","term":"202554","courseNumber":"2105","subject":"FIN","description":"Studies the basic theory, techniques, and application of financial analysis tools needed for business financial administration and decision making.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20068","seatCapacity":30,"seatRemaining":0,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Sacco, Samuel"},{"crn":"20142","seatCapacity":30,"seatRemaining":10,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Sacco, Samuel"}]},{"name":"Finance for New Ventures","term":"202554","courseNumber":"3100","subject":"FIN","description":"Focuses primarily on startup ventures and the methods most useful to early stages companies, including microfinance, crowdfunding, angel investing, and venture capital. Covers the financing mechanism of a startup, including nonprofit companies and social entrepreneurship ventures.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Creative Express/Innov"],"sections":[{"crn":"20109","seatCapacity":30,"seatRemaining":24,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Sacco, Samuel"}]},{"name":"Financial Institutions and Markets","term":"202554","courseNumber":"3310","subject":"FIN","description":"Explores the structure and functioning of the U.S. and international financial markets and institutions. Topics covered include banking theory; instruments of various financial markets; the roles of traditional and nontraditional financial intermediaries; and the impact of securitization, international financial competition, financial system stability, and financial regulation.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Societies/Institutions"],"sections":[{"crn":"20029","seatCapacity":30,"seatRemaining":17,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Goldberg, Gerson"}]},{"name":"Investments","term":"202554","courseNumber":"3340","subject":"FIN","description":"Studies the nature of securities, the mechanics and costs of trading, and the ways in which the securities markets operate. Applies risk-return analysis in making decisions to buy or sell stocks, bonds, options, and other investments. Requires a semester-long project in which students follow and analyze the performance of individual and a portfolio of investments with written analysis.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20114","seatCapacity":30,"seatRemaining":22,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Lowe, LaKeisha"}]},{"name":"Working Capital Management","term":"202554","courseNumber":"4220","subject":"FIN","description":"Explores short-term financial management. Reviews institutional and legal aspects as a context for making decisions involving current assets and current liabilities. This working capital management&#8212;the management of cash, inventories, accounts receivable, and short-term credit arrangements by business firms&#8212;provides the basis of long-term survival of businesses.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20056","seatCapacity":30,"seatRemaining":18,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Gray, George"},{"crn":"20326","seatCapacity":30,"seatRemaining":26,"waitlistCapacity":0,"waitlistRemaining":0,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Richards Hall","room":"325","days":[1],"startTime":1750,"endTime":2030,"final":false,"finalDate":null}],"faculty":"Melaragni, Francis"}]},{"name":"International Finance","term":"202554","courseNumber":"4230","subject":"FIN","description":"Studies the international financial environment in which organizations operate, including trade, balance of payments, capital flows, tariff policies, international economic institutions, currency, and exchange-rate issues. Explores international aspects of investment planning and financing decisions and other factors important to managing multicountry cash flows and financing of multinational corporations.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20057","seatCapacity":30,"seatRemaining":25,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"John, Samuel"}]},{"name":"Personal Financial Planning","term":"202554","courseNumber":"4240","subject":"FIN","description":"Focuses on the logic, concepts, tools, and applications of financial planning for retirement, estate planning, and financial risk management. Forecasts and analyzes various financial needs such as retirement income, health and insurance protection, dependent protection projections, etc., and utilizes investment vehicles to develop a financial plan to meet the forecast needs. Intended for those planning careers in personal financial advising in one of the various financial services environments.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20178","seatCapacity":30,"seatRemaining":18,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Kilmer, Heidi"}]},{"name":"Introduction to Engineering and Technology","term":"202554","courseNumber":"1100","subject":"GET","description":"Analyzes the diversity, need, and applicability of engineering as the profession that solves technical problems and drives technological innovation. Discusses essential requirements to succeed academically in engineering and introduces useful tools to optimize academic performance, such as the use of computers to perform calculations and mathematics to communicate engineering ideas. Reviews simple concepts of science and mathematics in historical and quantitative context, and uses small projects and in-class demonstrations to acquaint students with engineering concepts behind common technologic innovations. Discusses basic ideas for management of projects; techniques to formulate solutions to technical problems; and general structure for engineering design, manufacturing, and testing of products.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Natural/Designed World"],"sections":[{"crn":"20205","seatCapacity":30,"seatRemaining":25,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Haddad, Zahi"}]},{"name":"Engineering Technology Capstone Project Preparation and Proposal","term":"202554","courseNumber":"4840","subject":"GET","description":"Offers students an opportunity to apply the steps of the engineering design process and develop a comprehensive written engineering project proposal. Includes a review of the engineering design process from problem statement to prototype fabrication and testing. Working closely with the instructor, students are asked to identify a technological need of actual interest for local companies, communities, or students’ workplace and to follow the engineering design process. Students document the marketing, patent, and literature search for prior art, customer/engineering specifications, brainstorming process to generate feasible solutions, most viable solution selection process, and detailed labor and materials budget for actual execution of the solution to be completed in GET 4850.","maxCredits":2,"minCredits":2,"nupath":[" NUpath Writing Intensive"],"sections":[{"crn":"20173","seatCapacity":30,"seatRemaining":26,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Green, Edward"}]},{"name":"Foundations of Healthcare Management","term":"202554","courseNumber":"1100","subject":"HMG","description":"Examines the management of health services organizations (HSOs) and health systems from management functions, concepts, and principles to managerial roles, skills, and competencies within the context of HSOs and health systems and their external environment. Introduces managerial tools and techniques for managing effectively in the HSO/health systems environment. Emphasizes how health managers solve problems, make decisions, and conduct strategic planning. Studies the roles played by quality, productivity, and technology in establishing and maintaining a competitive position and how managers seek to manage the complex human relationships that exist within HSOs and health systems as well as other agencies and external stakeholders.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20030","seatCapacity":30,"seatRemaining":22,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Yorra, Mark"}]},{"name":"Healthcare Operations","term":"202554","courseNumber":"2100","subject":"HMG","description":"Focuses on operations management planning and execution. Explores the challenges of restructuring and control common to hospitals and other health services organizations.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20031","seatCapacity":30,"seatRemaining":26,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Bennett, Craig"}]},{"name":"Health Law and Regulation","term":"202554","courseNumber":"2110","subject":"HMG","description":"Examines the impact of health law and regulation on healthcare systems. Explores how to assess liability in the workplace, the impact of medical malpractice, risk management, and current ethical and legal dilemmas in the practice of medicine. Discusses how to manage the risk of the employer and patient through the use of medical records and specific behavior patterns, how to determine personal risk, and how to recognize potential litigious issues in the practice of medicine.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20107","seatCapacity":30,"seatRemaining":26,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"DeVincent-Cook, Heather"}]},{"name":"Nutrition","term":"202554","courseNumber":"1200","subject":"HSC","description":"Explores the fundamental role of nutrition in promoting health, wellness, and prevention of chronic disease. Topics include nutrients and nutritional needs across the life span; food safety and security; body weight regulation; and the genetic, social, and environmental influences on food choices and nutrition status.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Natural/Designed World"],"sections":[{"crn":"20032","seatCapacity":30,"seatRemaining":2,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Sarni-Garlow, Sandra"}]},{"name":"Pharmacology","term":"202554","courseNumber":"3320","subject":"HSC","description":"Offers the fundamentals of pharmacology to students entering the health professions. Topics include the general principles of drug action, drug distribution, and drug elimination. Focuses on principles of pharmacology and the major drug classifications in relation to the treatment of health problems. Emphasizes dose response, side effects/drug interactions, route of administration, and place in clinical therapy. Drugs are presented according to therapeutic or functional classification.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20033","seatCapacity":30,"seatRemaining":24,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Lancaster, Jason"}]},{"name":"Coming to America: The American Immigrant Experience","term":"202554","courseNumber":"2425","subject":"HST","description":"Examines the migration of people to North America. Analyzes the migration of Native Americans in ancient times, the arrival of European settlers and explorers, and the various waves of immigration to the United States from Europe, Africa, Asia, and Latin America. Emphasizes the diverse cultures that came, their reasons for coming, their reasons for settling in particular places, and the processes by which they resolved issues relating to &#8220;Americanization.&#8221;","maxCredits":3,"minCredits":3,"nupath":[" NUpath Difference/Diversity"," NUpath Societies/Institutions"],"sections":[{"crn":"20105","seatCapacity":30,"seatRemaining":18,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Hiltz, Stephen"}]},{"name":"Human Resources Management","term":"202554","courseNumber":"2320","subject":"HRM","description":"Examines and applies principles, practices, and current issues facing organizations as related to attracting, selecting, motivating, and keeping the most talented organizational members in today&#8217;s competitive environment. Focuses on human resource management strategy, organizational staffing, employee and labor relations, and organizational safety and security. Emphasizes current legal considerations and issues.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20088","seatCapacity":30,"seatRemaining":21,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Allen, Rita"}]},{"name":"Human Behavior in the Social Environment","term":"202554","courseNumber":"2240","subject":"HSV","description":"Offers students a foundation for understanding behavior as it applies within the context of dynamic human systems. Interactions with individuals, families, groups, organizations, and communities are at the core of practice. Explores the interrelationship between human development and behavior across the life span, focusing on the impact of surroundings such as culture, community, and social systems. Introduces research-oriented and practice-based perspectives to enhance students&#8217; development with regard to professional values, ethics, assessment, and intervention strategies. Emphasizes diverse and at-risk populations.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Societies/Institutions"],"sections":[{"crn":"20135","seatCapacity":30,"seatRemaining":15,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Mohan, Sabrina"}]},{"name":"Computer Applications","term":"202554","courseNumber":"1000","subject":"ITC","description":"Offers a beginning course in computer productivity tools for those with little or no prior experience. Introduces basic elements of organizing computer files and folders and of creating word processing documents, spreadsheets, and presentations. Requires a Windows environment.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20119","seatCapacity":30,"seatRemaining":5,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Trachtenberg, Edward"}]},{"name":"Operating Systems Concepts","term":"202554","courseNumber":"1200","subject":"ITC","description":"Introduces students to the basic structure and organization of computer operating systems. Examines the functional characteristics of major computer components and their relationship to control by software. Topics include general computer organization and configuration. Compares characteristics of different operating systems such as Windows and UNIX.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20166","seatCapacity":30,"seatRemaining":20,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Arzoughi, Fatema-Ros"}]},{"name":"Principles of Systems Analysis and Design","term":"202554","courseNumber":"2000","subject":"ITC","description":"Introduces the methodologies, models, tools, and techniques used in modern system development. Topics covered include&#160;&#160;project life-cycle models, project management techniques, requirements elicitation, use-case analysis, business rules, system design approaches, and graphic modeling with the Unified Modeling Language (UML). Offers students an opportunity to analyze and document a business case; complete a system analysis; and design, model, and prepare a project plan.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Natural/Designed World"],"sections":[{"crn":"20167","seatCapacity":30,"seatRemaining":17,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Hurtig Hall","room":"310","days":[1],"startTime":1750,"endTime":2020,"final":false,"finalDate":null}],"faculty":"Larson, Todd"},{"crn":"20301","seatCapacity":30,"seatRemaining":5,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Nevarez, Carla"}]},{"name":"End-User Data Analysis Tools","term":"202554","courseNumber":"2016","subject":"ITC","description":"Focuses on technical skills used for acquiring and analyzing data with advanced spreadsheet tools and with end-user database software. Students use advanced word processing techniques to present the results of data analysis. Expects students to already have basic skills in word processing and spreadsheet applications. Course uses Windows-based applications.&#160;&#160;","maxCredits":3,"minCredits":3,"nupath":[" NUpath Analyzing/Using Data"],"sections":[{"crn":"20034","seatCapacity":30,"seatRemaining":1,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Tinsley, Lawrence"},{"crn":"20103","seatCapacity":30,"seatRemaining":23,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Hatziyannis, Vivian"}]},{"name":"Designing the User Experience","term":"202554","courseNumber":"2050","subject":"ITC","description":"Studies user experience (UX) design theory and practice, focusing on its interdisciplinary nature. Describes the principles of UX and the practice of user interface design. Discusses the major human information processing subsystems (perception, memory, attention, and problem solving), and introduces usability metrics and evaluation methods.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20200","seatCapacity":30,"seatRemaining":2,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Conway, Timothy"},{"crn":"20307","seatCapacity":30,"seatRemaining":25,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Ryder Hall","room":"153","days":[2],"startTime":1750,"endTime":2020,"final":false,"finalDate":null}],"faculty":"Picard, Michael"}]},{"name":"Introduction to Programming (Java)","term":"202554","courseNumber":"2100","subject":"ITC","description":"Offers a hands-on first programming course for those with no prior programming experience. Covers basic programming logic and syntax. Uses object-oriented programming concepts, including arrays, methods, classes, and instantiation.&#160;Offers students an opportunity to code stand-alone computer applications with graphical user interfaces (GUI) using modern interactive development tools.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20169","seatCapacity":30,"seatRemaining":17,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Meesala, Dinesh"}]},{"name":"Networking Foundations","term":"202554","courseNumber":"2200","subject":"ITC","description":"Introduces principles of computer networks, network architectures, network topologies, network protocols, and layering concepts.&#160;&#160;Addresses both theoretical aspects, such as performance modeling and analysis, and practical considerations of implementing Internet protocols.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20174","seatCapacity":30,"seatRemaining":8,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Kafka, Stephen"}]},{"name":"Database Management Systems","term":"202554","courseNumber":"2300","subject":"ITC","description":"Introduces Structured Query Language (SQL). Topics include designing normalized data tables for use in a relational database management system, creating entity-relationship models,&#160;database transaction processing, and security.&#160;&#160;","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20168","seatCapacity":30,"seatRemaining":0,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Rodd, Yazdan"}]},{"name":"Web and Mobile Development","term":"202554","courseNumber":"2400","subject":"ITC","description":"Studies modern markup languages and standards (HTML5 and CSS) for cross-platform webpages and applications. Through lectures, discussions, and hands-on projects, offers students an opportunity to learn common best practices in graphical interface design and usability for different target audiences. They then have an opportunity to apply these design skills by refining creative designs into websites through an iterative process of creating hand-drawn storyboards, then coding wireframes, adding basic web content, and finally making pages responsive so that they are suitable for a variety of mobile devices. Webpage artifacts include tables, images, links, and simple apps.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Creative Express/Innov"],"sections":[{"crn":"20170","seatCapacity":30,"seatRemaining":0,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Craven, Bryan"},{"crn":"20308","seatCapacity":30,"seatRemaining":21,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Hurtig Hall","room":"310","days":[3],"startTime":1750,"endTime":2020,"final":false,"finalDate":null}],"faculty":"Craven, Bryan"}]},{"name":"Advanced Applications Development (Android)","term":"202554","courseNumber":"3100","subject":"ITC","description":"Focuses on developing complex end-user applications (for Android) that address a business problem or opportunity. Topics include utilizing database interfaces and managing user sessions.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20260","seatCapacity":30,"seatRemaining":18,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Miller, Elizabeth"}]},{"name":"Exploring NoSQL Databases","term":"202554","courseNumber":"3310","subject":"ITC","description":"Explores the capabilities and applications of NoSQL technology in today's fast-paced digital world. Covers essential topics such as database architecture, security, and data distribution techniques in a NoSQL context. Offers students an opportunity to obtain hands-on practice with the most common nonrelational databases used in contemporary applications development.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20302","seatCapacity":30,"seatRemaining":23,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Tasker, Benjamin"}]},{"name":"IT Project Management","term":"202554","courseNumber":"3500","subject":"ITC","description":"Covers the tools and techniques used to manage information technology (IT) projects. Topics include project planning, scheduling, and budgeting and project management tools (PERT/CPM/Gantt). Discusses all phases of IT projects from proposal evaluation through postimplementation reviews. Offers students an opportunity to plan and develop a project that provides a practical application of the topics covered in class.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Writing Intensive"],"sections":[{"crn":"20201","seatCapacity":30,"seatRemaining":19,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Leussler, David"}]},{"name":"Legal and Ethical Issues in Cybersecurity","term":"202554","courseNumber":"3620","subject":"ITC","description":"Describes the legal and ethical issues associated with information security. Emphasizes national and international laws relating to information assurance and data use and emerging technologies for management of digital rights. Examines criminal activities such as computer fraud and abuse, desktop forgery, embezzlement, child pornography, computer trespass, and computer piracy.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Ethical Reasoning"],"sections":[{"crn":"20171","seatCapacity":30,"seatRemaining":6,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Lauer, Betty"}]},{"name":"Network Security","term":"202554","courseNumber":"4200","subject":"ITC","description":"Explores the theory and practice of computer security, focusing on the security aspects of multiuser systems and the Internet. Topics include cryptography concepts, firewalls; viruses; two-tier authentication; Trojan horses; password security; biometrics; VPNs; Internet protocols such as SSL, IPsec, PGP, SNMP, SSH; and others.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20303","seatCapacity":30,"seatRemaining":26,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Agress, Jason"}]},{"name":"Information Security Management","term":"202554","courseNumber":"4600","subject":"ITC","description":"Covers management issues occurring within the field of information security. Topics include asset classification and control (protecting the most valuable information of the organization); personnel security (employee awareness); security as a part of everyday communications and operations; business continuity management; and compliance (legal, internal/external, audit, and other concerns).","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20311","seatCapacity":30,"seatRemaining":9,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Woodson, Michael"}]},{"name":"Encryption Concepts","term":"202554","courseNumber":"4660","subject":"ITC","description":"Surveys the principles and the practices of encryption and cryptography and the core encryption algorithms used in digital communication. Discusses core information assurance building blocks&#8212;such as authentication, digital signatures, key management, and digital certificates&#8212;and applies these concepts to important security architectures, including the IP networks and the cellular system.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20304","seatCapacity":30,"seatRemaining":23,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Yamauchi, Owen"}]},{"name":"Software Engineering and Security","term":"202554","courseNumber":"4690","subject":"ITC","description":"Focuses on secure software engineering. Offers students an opportunity to practice the development of software that adheres to secure design principles and uses modern software engineering best practices throughout the Secure Systems Development Lifecycle.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20305","seatCapacity":30,"seatRemaining":19,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Lauer, Betty"}]},{"name":"Information Technology Project","term":"202554","courseNumber":"4850","subject":"ITC","description":"Offers students an opportunity to utilize skills from across the discipline to create a final IT project in a team environment. This is the capstone course for the program, designed as the culminating experience that engages students in the execution of a real-world project.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Capstone Experience"," NUpath Writing Intensive"],"sections":[{"crn":"20184","seatCapacity":30,"seatRemaining":21,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Brandquist, Kurt"},{"crn":"20306","seatCapacity":30,"seatRemaining":23,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Richards Hall","room":"228","days":[1],"startTime":1750,"endTime":2020,"final":false,"finalDate":null}],"faculty":"Leussler, David"}]},{"name":"Experiential Project Preparation","term":"202554","courseNumber":"2000","subject":"INT","description":"Designed to prepare students for an experiential learning placement. Encourages students to align academic goals with professional outcomes, course curriculum, and experiential learning opportunities. Offers students an opportunity to better understand key components of networks, business professionalism, and effective communication. Topics include resumé writing, defining a career field, assessing skills and abilities related to developing a career, and building cultural competency awareness. Asks students to develop a comprehensive, strategic job search plan along with effective related career documents. Introduces the College of Professional Studies’ cooperative education and academic internship policies, procedures, and expectations.","maxCredits":1,"minCredits":1,"nupath":[],"sections":[{"crn":"20150","seatCapacity":30,"seatRemaining":5,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Seminar","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"TBA"}]},{"name":"Assessing Your Leadership Capacity","term":"202554","courseNumber":"1200","subject":"LDR","description":"Introduces the methodologies and processes that are essential aspects of leadership: conceptualizing motivation, identifying traits, creating a vision, understanding influence, overcoming obstacles, developing character, and establishing a professional brand. Offers students an opportunity to focus on self-awareness, reflection, individual effectiveness, and self-assessment to learn how to recognize and utilize the differences between themselves and others. Students receive ongoing feedback from their peers and a chance to develop their own philosophy of leadership. The successful student should be able to answer the question, &#8220;What does it take to be a 21st-century leader?&#8221;","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20122","seatCapacity":30,"seatRemaining":19,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Soares, Steven"}]},{"name":"Leading Teams Locally and Virtually","term":"202554","courseNumber":"3250","subject":"LDR","description":"Covers the skills needed to manage teams in one office, in multisite locations, internationally or virtually. Topics include effective communication strategies, how to structure teams within an intergenerational environment, and how to leverage individual strengths to lead high-performance teams. Offers students an opportunity to identify barriers, study strategic methods for overcoming obstacles, leverage technology to build virtual spaces for people and ideas, and work to develop a strategy to optimize team effectiveness through a shared process and peer coaching by participating on a cohort team. The successful student should be able to understand their role as a catalyst, visionary, and leader in the formation and success of any team.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20133","seatCapacity":30,"seatRemaining":24,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Watson, Thomas"}]},{"name":"Evidence-Based Leadership and Decision Making","term":"202554","courseNumber":"3400","subject":"LDR","description":"Examines the components of evidence-based leadership that have been tested in various settings, shown to be effective, operational, and able to be used in solving real-world dilemmas. Emphasizes using decision-making models to analyze behaviors, align organizational goals, determine consequences, and make recommendations for actions leaders can make to solve problems. Studies the relationship(s) between scientific data, academic theory, technological advances, and changes in society toward the goal of understanding ethical problems. The successful student should be able to demonstrate increased information literacy, identify strategies for decision making, and know where to seek evidence needed in order to make high-quality decisions on a wide range of issues.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Writing Intensive"],"sections":[{"crn":"20080","seatCapacity":25,"seatRemaining":13,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Soares, Steven"}]},{"name":"Strategic Decision Making (Capstone)","term":"202554","courseNumber":"4850","subject":"LDR","description":"Offers students an opportunity to examine and test leadership theory in practice. Students demonstrate their leadership knowledge gained during their undergraduate studies by completing an experiential action-oriented project. Under faculty guidance and approval, each student must present a body of work that addresses a critical leadership topic that will enhance their professional development as a 21st-century leader. Experiences can be undertaken within any industry sector or at the workplace with supervisor approval. Past projects have included research studies, case studies, new products, leadership development plans, publications, journals, magazines, media/films, training programs, etc. Requires students to deliver a presentation on their project and share a culmination of learned outcomes.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Capstone Experience"," NUpath Integration Experience"," NUpath Writing Intensive"],"sections":[{"crn":"20134","seatCapacity":30,"seatRemaining":30,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Geary, Charlene"}]},{"name":"Introduction to Business","term":"202554","courseNumber":"1100","subject":"MGT","description":"Offers students an opportunity to develop a business vocabulary, refine business decision-making skills, and foster critical and analytical thinking. Examines key external factors that influence business development, namely political, economic, legal, social, and technological forces. Explores the internal organization of business, analyzing major issues associated with the key management functions of marketing, strategy, finance, accounting, information systems, and operations.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20255","seatCapacity":30,"seatRemaining":19,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Richards Hall","room":"225","days":[4],"startTime":1750,"endTime":2020,"final":false,"finalDate":null}],"faculty":"Westgate, Lisa"},{"crn":"20092","seatCapacity":30,"seatRemaining":0,"waitlistCapacity":5,"waitlistRemaining":4,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Koch, Peter"}]},{"name":"Principles of Management","term":"202554","courseNumber":"2100","subject":"MGT","description":"Examines historical changes in workforce composition and the many effects of globalization, technological change, and new workforce arrangements. Offers students an opportunity to apply critical thinking to topics related to the managerial tasks of planning, organizing, leading, and controlling. Emphasizes discussions on diversity in organizations, social responsibility, managerial ethics, and the impact of globalization.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20035","seatCapacity":30,"seatRemaining":22,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Casey, Matthew"}]},{"name":"Information within the Enterprise","term":"202554","courseNumber":"2210","subject":"MGT","description":"Addresses the central role of information management (IM) and information technology (IT) systems in running and managing a business and in infusing it with competitive advantage. Business leaders must have ready access to timely, accurate, and relevant information if they are to manage and compete effectively in the global economy. Explores how a wide range of enterprises around the world employ IM to operate, to manage and control, and to plan and innovate. Focuses on real business issues, analysis and problem solving, and out-of-the-box thinking in creating value to the enterprise by effectively applying IM and IT. Rather than focusing on specific technical content or skills, this course is entirely case driven.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20120","seatCapacity":30,"seatRemaining":8,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Larson, Todd"},{"crn":"20070","seatCapacity":30,"seatRemaining":26,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"89 Broad Street","room":"211","days":[4],"startTime":1750,"endTime":2020,"final":false,"finalDate":null}],"faculty":"Haley, John"}]},{"name":"Supply Chain Management","term":"202554","courseNumber":"2220","subject":"MGT","description":"Explores the basic concepts of managing a supply chain that produces goods and/or services. Offers students an opportunity to examine the fundamental functions and processes of a fully integrated supply chain, identify the key business and economic drivers of supply chain performance, and understand the strategic decisions that enable a supply chain to directly support business objectives. Topics include basic functions within a supply chain&#8212;planning, sourcing, forecasting and demand planning, manufacturing, inventory management, logistics, just-in-time (JIT), lean, Six Sigma, outsourcing, and sustainability.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20104","seatCapacity":30,"seatRemaining":9,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Westgate, Lisa"}]},{"name":"Organizational Behavior","term":"202554","courseNumber":"2310","subject":"MGT","description":"Studies psychological, sociological, and organizational theories and principles underlying interpersonal communication in the organization. Through written analysis of case studies and role-playing, offers students an opportunity to analyze the impact of varying organizational decisions and dynamics on employee and management behavior. Discusses how embracing human differences and implementing diversity initiatives contribute to both organizational performance and the advancement of the society as a whole.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Difference/Diversity"],"sections":[{"crn":"20085","seatCapacity":30,"seatRemaining":18,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Ryder Hall","room":"435","days":[2],"startTime":1750,"endTime":2020,"final":false,"finalDate":null}],"faculty":"Glasier, Mark"},{"crn":"20106","seatCapacity":30,"seatRemaining":0,"waitlistCapacity":5,"waitlistRemaining":1,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Siragusa, Brenda"}]},{"name":"Business Law","term":"202554","courseNumber":"2330","subject":"MGT","description":"Introduces the foundations and principles of American legal jurisprudence and aspects of the legal environment that impact business executives. Begins with an overview of the court system, litigation, and the U.S. Constitution. Emphasizes the roles of contract law, tort law, criminal law, and property rights in business. Focuses on the legal organization and operation of business entities such as corporations, limited liability companies, and partnerships, including corporate governance models, board of director liability, shareholder conflicts, proxy contests, and stakeholder rights. Special topics affecting business include intellectual property, employment laws, discrimination in the workplace, international law, and securities regulations.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20087","seatCapacity":30,"seatRemaining":6,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Guisbond, Andrew"},{"crn":"20256","seatCapacity":30,"seatRemaining":18,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Richards Hall","room":"226","days":[3],"startTime":1520,"endTime":1750,"final":false,"finalDate":null}],"faculty":"Daley, Kevin"}]},{"name":"International Business","term":"202554","courseNumber":"3220","subject":"MGT","description":"Focuses on the principles and practices of international business, comparing domestic and international activities and managerial responsibilities. Examines the major facets of the international management environment (legal, political, economic, and cultural). Explores international strategies by assessing the main factors determining success and failure of international companies. Offers students an opportunity to describe and compare domestic and international management operations and issues such as managing a multicultural workforce, designing and executing global marketing strategies, designing global products and services, and managing global R&amp;D.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Societies/Institutions"],"sections":[{"crn":"20036","seatCapacity":30,"seatRemaining":12,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Weissman, Richard"}]},{"name":"Project Management","term":"202554","courseNumber":"4210","subject":"MGT","description":"Focuses both on the analytical tools to manage projects as well as the people-management tools necessary for project success. Examines the entire process of implementing a project, from project definition to the evaluation of feasibility, scheduling, quality criteria, and financial and budgetary factors. Offers students an opportunity to apply contemporary management techniques based on Project Management Institute (PMI) current practices and to become familiar with current software options.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20037","seatCapacity":25,"seatRemaining":9,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Mellen, Christopher"},{"crn":"20253","seatCapacity":30,"seatRemaining":27,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Hurtig Hall","room":"308","days":[3],"startTime":1750,"endTime":2020,"final":false,"finalDate":null}],"faculty":"Mellen, Christopher"}]},{"name":"Innovation and Change Management","term":"202554","courseNumber":"4220","subject":"MGT","description":"Offers students an opportunity to discuss and apply principles, tools, and methods to successfully implement change and innovation within organizations. The use of multiple perspectives to assess organizational performance seeks to ensure that students are not trapped by a &#8220;one-best-way&#8221; approach to change management. Discusses strategies to design, implement, communicate, and sustain change; techniques for mapping and assessing when and where change is needed in an organization; organizational development techniques; as well as barriers and enablers to fostering an environment conducive to change and innovation.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20038","seatCapacity":30,"seatRemaining":16,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Walsh, Martin"}]},{"name":"New Venture Creation","term":"202554","courseNumber":"4230","subject":"MGT","description":"Examines the theory and practice of developing and managing innovations in startups and in already established firms. Offers students an opportunity to apply frameworks, strategies, business models, idea-generation techniques, and funding methods for introducing new products and services. Examines such topics as the creative process, the formulation of a business plan, and the execution of the plan itself.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Creative Express/Innov"," NUpath Writing Intensive"],"sections":[{"crn":"20089","seatCapacity":30,"seatRemaining":24,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"McCullough, Robert"},{"crn":"20254","seatCapacity":30,"seatRemaining":28,"waitlistCapacity":0,"waitlistRemaining":0,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Ryder Hall","room":"155","days":[2],"startTime":1750,"endTime":2020,"final":false,"finalDate":null}],"faculty":"Boviard, Carolyn"}]},{"name":"Business Strategy","term":"202554","courseNumber":"4850","subject":"MGT","description":"Examines how companies in different industries choose goals and strategically position themselves in the business environment. Examines the total management process from planning to execution. Offers students an opportunity to critically reflect about issues, including long-term planning, corporate social responsibility, diversification, and building dynamic capabilities through the application of strategic frameworks. As a capstone course, it relies on and combines skills from several business disciplines&#8212;marketing, finance and accounting, organizational behavior, operations, and management information systems.","maxCredits":4,"minCredits":4,"nupath":[" NUpath Capstone Experience"," NUpath Writing Intensive"],"sections":[{"crn":"20039","seatCapacity":30,"seatRemaining":18,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Lefevre, Duane"},{"crn":"20141","seatCapacity":30,"seatRemaining":28,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Sieloff, Jeffrey"},{"crn":"20116","seatCapacity":20,"seatRemaining":14,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Snell Library","room":"009","days":[3],"startTime":1750,"endTime":2110,"final":false,"finalDate":null}],"faculty":"Lush, Richard"}]},{"name":"Principles of Marketing","term":"202554","courseNumber":"2100","subject":"MKT","description":"Introduces the fundamentals of marketing management, including marketing strategy, consumer decision making, market segmentation and targeting, product, promotion, distribution, and pricing strategies. Emphasizes the importance of ethical behavior in marketing in both profit and nonprofit organizations operating at a domestic or a global level.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20040","seatCapacity":30,"seatRemaining":0,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Rego, Michelle"}]},{"name":"Consumer Behavior","term":"202554","courseNumber":"2220","subject":"MKT","description":"Examines the major theoretical approaches to consumer behavior. Examines how the concepts of affect and cognition, behavior, and learning can be used to design and execute an effective marketing strategy in an environment that is more consumer empowered. Understanding the decision-making process, attitude, and behavior of buyers, as well as the impact of the environment, is essential to developing marketing plans in which sophisticated customer relationship management approaches are dependent upon knowing the customer needs and motives. Offers students an opportunity to gain a better understanding of their own buying behavior.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20041","seatCapacity":30,"seatRemaining":16,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"McCullough, Robert"}]},{"name":"College Algebra","term":"202554","courseNumber":"1100","subject":"MTH","description":"Covers laws of exponents, factoring, inequalities, polynomials, roots, linear and quadratic equations, complex numbers, rational functions, systems of equations, exponential and logarithmic functions, and inverse functions. Requires students to communicate mathematical ideas using symbolic and written forms and to apply algebraic concepts to real-life applications. Seeks to provide students with a solid foundation of concepts and skills necessary to advance to statistics or precalculus. Requires prior knowledge of the manipulation and simplification of basic algebraic expressions.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Formal/Quant Reasoning"],"sections":[{"crn":"20042","seatCapacity":30,"seatRemaining":0,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Finigan, Joseph"},{"crn":"20075","seatCapacity":30,"seatRemaining":13,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Finigan, Joseph"}]},{"name":"Calculus 1","term":"202554","courseNumber":"2100","subject":"MTH","description":"Focuses primarily on differential calculus. Using mathematical models, offers students an opportunity to make predictions and inferences in a variety of applications that relate to the fields of engineering, economics, biology, etc. For example, students can use differential calculus to determine what is the most cost-effective speed to drive a car, using the least amount of fuel. These types of problems, called optimization problems, require an understanding of the derivative as a rate of change. The course focuses on how to apply rules and properties of derivatives to model and solve application problems in science, engineering, and technology. As a prelude to MTH 2105, at the end of the semester, the concept of the integral is introduced as a limit of sums and antidifferentiation.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Formal/Quant Reasoning"],"sections":[{"crn":"20043","seatCapacity":30,"seatRemaining":18,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Bears, Jeffrey"}]},{"name":"Technical Math 1","term":"202554","courseNumber":"2120","subject":"MTH","description":"Reviews topics of trigonometry, differential and integral calculus. Emphasis is placed on limits, continuity, derivatives and integrals of algebraic and transcendental functions of one variable. Upon completion, students should be able to select and use appropriate models and techniques for finding solutions to derivative-related problems with and without technology. This is an accelerated course for designed for Advanced Manufacturing Systems and Engineering Technology students.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20207","seatCapacity":30,"seatRemaining":26,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"DeCristofano, Barry"}]},{"name":"Business Statistics","term":"202554","courseNumber":"2300","subject":"MTH","description":"Offers students an opportunity to obtain the necessary skills to collect, summarize, analyze, and interpret business-related data. Covers descriptive statistics, sampling and sampling distributions, statistical inference, relationships between variables, formulating and testing hypotheses, and regression analysis in the context of business decision making.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Analyzing/Using Data"],"sections":[{"crn":"20123","seatCapacity":30,"seatRemaining":22,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Driscoll, John"}]},{"name":"Statistics for the Behavioral and Social Sciences","term":"202554","courseNumber":"2310","subject":"MTH","description":"Offers students an opportunity to obtain the necessary skills to collect, summarize, analyze, and interpret social and behavioral science data. Covers descriptive statistics, sampling and sampling distributions, statistical inference, relationships between variables, formulating and testing hypotheses, and regression analysis in the context of the social and behavioral sciences.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Analyzing/Using Data"," NUpath Formal/Quant Reasoning"],"sections":[{"crn":"20077","seatCapacity":30,"seatRemaining":11,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Bears, Jeffrey"}]},{"name":"Technology and Applications of Discrete Mathematics","term":"202554","courseNumber":"2400","subject":"MTH","description":"Offers students experience with and exposure to ideas and techniques from discrete mathematics, which is at the foundation of the technological disciplines. Focuses on applications and practical use of discrete mathematics as it is applied to the computing sciences and engineering disciplines. Topics covered include sets; logic; Boolean algebra; machine representations of numbers (decimal, binary, octal, hexadecimal) and arithmetic; counting methods; graphs; and trees. Specific applications include algorithms and complexity, circuits and circuit diagrams, searching and sorting, networks, probability, and finite-state machines. Requires students to select and apply appropriate techniques from discrete math to address common problems found in modern technological systems, especially software and computing hardware design.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Formal/Quant Reasoning"],"sections":[{"crn":"20079","seatCapacity":30,"seatRemaining":8,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Magnarelli, Dominic"}]},{"name":"Statistical Quality Control","term":"202554","courseNumber":"2500","subject":"MTH","description":"Introduces statistical analysis and concepts related to engineering manufacturing quality control, including process capability, control charts, acceptance sampling, and process improvement. Other topics include Six Sigma, statistical and graphical data summaries, quality engineering, and quality design.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20272","seatCapacity":30,"seatRemaining":27,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Karimpour, Amin"}]},{"name":"Engineering Manufacturing Process","term":"202554","courseNumber":"2040","subject":"MET","description":"Introduces learners to engineering materials, property enhancement technologies, metrology, assembly operations, and rapid prototyping. Discusses a variety of methods for improving bulk and surface properties based on materials compositions, structures, and desired performance. These include heat treatment, plasma surface engineering, and other vacuum technologies. Introduces industrial robotics, numeric control, and programmable logic controllers. Studies and discusses production systems, process planning and quality control, and production inspection based on various industrial applications.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20206","seatCapacity":30,"seatRemaining":23,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"TBA"}]},{"name":"Mechanics 2: Dynamics","term":"202554","courseNumber":"2200","subject":"MET","description":"Expands and uses the underlying principles and concepts of Newtonian mechanics to study, analyze, and solve problems relative to mechanical systems in motion. Explores approaches to analyze motion both neglecting and considering the cause of motion and their relationship to the design of engineering systems. Discusses subjects pertaining to the study of kinematics and dynamics of particles and rigid bodies in detail. Topics include linear, curvilinear, and rotational motion of particles and rigid bodies, as well as conservation principles and concepts and inherent definitions for the analysis and design of dynamic systems such as velocity, acceleration, linear and angular momentum, impulse, forces, work, kinetic and potential energy, total mechanical energy, and power.&#160;&#160;","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20271","seatCapacity":30,"seatRemaining":27,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"DeCristofano, Barry"}]},{"name":"Business Ethics","term":"202554","courseNumber":"2100","subject":"PHL","description":"Focuses on basic ethical viewpoints as a foundation and examines specific characteristics of business life through cases and examples. The fact that there is not one universal set of behaviors one considers ethical and no guidelines to follow to determine ethical behavior poses unique challenges to managers today. Yet, managers are daily faced with situations where individual values may conflict with those of teams or organizations. Explores topics such as corporate responsibility and conflict of interest, employee rights, and advertising and information disclosure.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Ethical Reasoning"],"sections":[{"crn":"20044","seatCapacity":30,"seatRemaining":23,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Dodge Hall","room":"140","days":[4],"startTime":1750,"endTime":2035,"final":false,"finalDate":null}],"faculty":"Mellen, Christopher"},{"crn":"20125","seatCapacity":30,"seatRemaining":13,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Mellen, Christopher"}]},{"name":"Ethical Issues in Communication","term":"202554","courseNumber":"2120","subject":"PHL","description":"Examines ethical issues in communication. Discusses how ethical choices affect communication to internal and external audiences, management transparency, strategic ambiguity, and employee privacy.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Ethical Reasoning"],"sections":[{"crn":"20045","seatCapacity":30,"seatRemaining":21,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Daley, Kevin"}]},{"name":"Ethical Issues in Healthcare","term":"202554","courseNumber":"2130","subject":"PHL","description":"Considers biomedical, clinical, social, and legal issues related to ethical issues and integrates such considerations into ethical decision making. Emphasizes the concepts of do no harm, quality of life, and conflict resolution. Other topics include patients&#8217; rights and the protection of their confidentiality, privacy, and personal prerogatives. Explores case studies and readings to assess the presence of ethical considerations.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Ethical Reasoning"],"sections":[{"crn":"20199","seatCapacity":30,"seatRemaining":18,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Gasper, Philip"}]},{"name":"Symbolic Logic","term":"202554","courseNumber":"2310","subject":"PHL","description":"Introduces propositional and first-order quantification logic. Offers students an opportunity to evaluate the status of logical formulas and arguments, to create examples and counterexamples, and to construct both informal and formal proofs.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Formal/Quant Reasoning"],"sections":[{"crn":"20279","seatCapacity":30,"seatRemaining":26,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Grenier, James"}]},{"name":"Physics 1","term":"202554","courseNumber":"1200","subject":"PHY","description":"Offers the first semester of a two-semester introduction to algebra-based physics. Emphasizes the underlying concepts and principles of Newtonian physics and fluids. Introduces measurement, estimating, and Newtonian mechanics. Topics covered include kinematics, dynamics, translational motion, vectors, circular motion, gravitation, work, energy, power, momentum, and rotational motion. Further topics covered include static equilibrium, elasticity and fracture, fluids, vibrations, waves, and sound.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Natural/Designed World"],"sections":[{"crn":"20065","seatCapacity":30,"seatRemaining":15,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Richards Hall","room":"225","days":[1],"startTime":1750,"endTime":2020,"final":false,"finalDate":null}],"faculty":"Carlson, Scott"}]},{"name":"Lab for PHY 1200","term":"202554","courseNumber":"1201","subject":"PHY","description":"Accompanies PHY 1200. Covers topics from the course through various experiments.","maxCredits":1,"minCredits":1,"nupath":[],"sections":[{"crn":"20066","seatCapacity":10,"seatRemaining":1,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lab","honors":false,"campus":"Boston","meetingTimes":[{"building":"Churchill Hall","room":"319","days":[1],"startTime":2030,"endTime":2200,"final":false,"finalDate":null}],"faculty":"TBA"},{"crn":"20074","seatCapacity":10,"seatRemaining":4,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lab","honors":false,"campus":"Boston","meetingTimes":[{"building":"Churchill Hall","room":"319","days":[1],"startTime":2030,"endTime":2200,"final":false,"finalDate":null}],"faculty":"TBA"}]},{"name":"Physics 2","term":"202554","courseNumber":"2200","subject":"PHY","description":"Offers the second semester of a two-semester introduction to algebra-based physics. Emphasizes the underlying concepts and principles of electricity and thermodynamics. Introduces temperature, the kinetic theory of matter, heat, the laws of thermodynamics, electricity, and Coulomb’s law. Topics covered include electric charge and fields, electric potential, electric current circuits, electric capacitance, magnetic forces and fields, and electromagnetic induction. Further topics covered include alternating current circuits, magnetism, electromagnetic waves, the nature of light, and geometric optics.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Natural/Designed World"],"sections":[{"crn":"20112","seatCapacity":30,"seatRemaining":23,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Dodge Hall","room":"140","days":[3],"startTime":1750,"endTime":2020,"final":false,"finalDate":null}],"faculty":"Webber, Matthew"}]},{"name":"Lab for PHY 2200","term":"202554","courseNumber":"2201","subject":"PHY","description":"Accompanies PHY 2200. Covers topics from the course through various experiments.","maxCredits":1,"minCredits":1,"nupath":[],"sections":[{"crn":"20113","seatCapacity":10,"seatRemaining":3,"waitlistCapacity":0,"waitlistRemaining":0,"classType":"Lab","honors":false,"campus":"Boston","meetingTimes":[{"building":"Churchill Hall","room":"319","days":[3],"startTime":2030,"endTime":2200,"final":false,"finalDate":null}],"faculty":"TBA"}]},{"name":"Project Monitoring and Control","term":"202554","courseNumber":"2000","subject":"PJM","description":"Explores the role of the project manager during project execution and the tools, techniques, and processes used to monitor and control the project. Offers students an opportunity to utilize project baselines to monitor progress, resolve issues, and manage changes. Applies analytics and earned value to determine the health of the project and identify and implement actions to continue, revise, or terminate the project. Addresses additional topics, including performance reporting and dashboards, to highlight best practices in providing project information to key stakeholders.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20158","seatCapacity":30,"seatRemaining":13,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"De Martino, Fabio"}]},{"name":"Leading Agile Projects","term":"202554","courseNumber":"3000","subject":"PJM","description":"Offers an overview of agile project methodologies. Introduces agile approaches, compares and contrasts these approaches to traditional project management, and considers how to tailor the two approaches to determine a project’s best approach. Additionally, reviews agile-specific practices from an application perspective and investigates agile project management tools.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20245","seatCapacity":30,"seatRemaining":22,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Yonce, Michael"}]},{"name":"Introduction to Behavioral Health Science Professions","term":"202554","courseNumber":"1050","subject":"PSY","description":"Introduces students to the major and to the landscape of behavioral health professions. Offers students an opportunity to consider their professional track and to begin formulating goals. Acclimates students to the Northeastern network, including how to access the professional, interpersonal, and academic resources available. Introduces students to their faculty advisors and fellow students and describes available experiential learning opportunities. Familiarizes students with undergraduate research and technological resources. Introduces the mindsets, dispositions, and competencies to support academic, professional, and personal sustainability.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20139","seatCapacity":30,"seatRemaining":26,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Parker-McGowan, Quannah"}]},{"name":"Foundations of Psychology","term":"202554","courseNumber":"1100","subject":"PSY","description":"Surveys the fundamental principles, concepts, and issues in the major areas of contemporary scientific psychology. Approaches the study of psychology as a method of inquiry as well as a body of knowledge. Offers students an opportunity to obtain a basis for more advanced study of the science of psychology. Examines origins and methods of psychology, including neuroscience, consciousness, cognition, development, nature and nurture debate, psychosocial development, learning and memory, language, motivation, personality, group dynamics, therapy, health psychology, and psychological disorders.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Natural/Designed World"],"sections":[{"crn":"20046","seatCapacity":30,"seatRemaining":16,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Igo, Patricia"},{"crn":"20266","seatCapacity":27,"seatRemaining":22,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Hayden Hall","room":"222","days":[4],"startTime":1750,"endTime":2020,"final":false,"finalDate":null}],"faculty":"Texeira, Kenneth"}]},{"name":"Principles of Human Learning","term":"202554","courseNumber":"2110","subject":"PSY","description":"Presents the basic learning principles that permit humans to adapt effectively to a changing environment. Covers the science of how humans learn and the research and techniques of classical and operant conditioning with discussions of discrimination and generalization, biological constraints on learning, and other related topics. Relates learning principles to the understanding and treatment of behavioral, affective, cognitive, and motivational disorders.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20140","seatCapacity":30,"seatRemaining":18,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Riberdy, Anne"}]},{"name":"Stress, Resilience, and Behavior Change","term":"202554","courseNumber":"2230","subject":"PSY","description":"Offers a research-experiential approach to understanding the benefits and negative consequences of stress and its effects on human behavior and physiology. Discusses the work of researchers and practitioners in stress response. Topics include the relation of stress to health, communication, relationships, and academic and work performance. Examines the behavioral strategies associated with leveraging the stress response in personal and professional arenas. Considers perspectives of resilience, coping, and behavioral change from various social and cultural standpoints.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20072","seatCapacity":30,"seatRemaining":14,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Mohan, Sabrina"}]},{"name":"Human Sexuality and Love","term":"202554","courseNumber":"2240","subject":"PSY","description":"Focuses on the historical, biological, psychological, developmental, and social/cultural influences on human sexuality and its expression. Sexuality lies at the core of our identities as human beings, yet many adults are uninformed of basic aspects of sexual anatomy and function. Topics include sexual anatomy and physiology, contraception and abortion, pregnancy and childbirth, gender identity, role and expression, romantic love, sexual minorities, media impact on sexuality, and attitudes toward contemporary issues.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20076","seatCapacity":30,"seatRemaining":14,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Cichocki, Kelly"}]},{"name":"The Opioid Crisis","term":"202554","courseNumber":"3150","subject":"PSY","description":"Focuses on the complexities of addiction across the life span, including the associated biological, psychological, and social factors. The exorbitant rise in rates of opioid addiction and overdoses world-wide require effective, evidence-based interventions to support the millions of individuals, families, communities, and societies affected. Examines the continuum of care model including promotion, prevention, treatment, and recovery. Topics include key risk and protective factors; co-occurring disorders; and evidence-based practices and methods of engaging diverse constituents through outreach, education, service delivery, capacity building, and systems change.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20161","seatCapacity":30,"seatRemaining":23,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Mulvey, Kevin"}]},{"name":"Social Psychology","term":"202554","courseNumber":"3200","subject":"PSY","description":"Surveys the socialization process, including social motives, interpersonal perception, group membership and structure, gender and culture, attitudes, prejudice, and leadership. Social psychology is embedded in our professional and personal roles. Identifies key theories and frameworks to apply in today&#8217;s work and living arenas.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20047","seatCapacity":30,"seatRemaining":16,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Casey, Robert"}]},{"name":"Cognition and Language","term":"202554","courseNumber":"3220","subject":"PSY","description":"Offers an in-depth analysis of human cognition and language. Topics include pattern recognition, attention, memory, categorization and concept formation, problem solving, and aspects of cognitive development. Examines current theories of cognitive processing and related experimental findings. Introduces psycholinguistics, the nature and structure of language, its biological bases, acquisition, production, and perception.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20280","seatCapacity":30,"seatRemaining":21,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Riberdy, Anne"}]},{"name":"Research in Psychology","term":"202554","courseNumber":"3450","subject":"PSY","description":"Explores research methods in psychology including observational, correlational, survey, and experimental methods. Uses the scientific method in the design, execution, analysis, and communication of psychological investigations. Discusses the ethics of research and evaluation methods. Offers students an opportunity to conduct psychological studies using a variety of methods and to write a substantial research paper.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Writing Intensive"],"sections":[{"crn":"20121","seatCapacity":30,"seatRemaining":22,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Rosales, Anna"}]},{"name":"Physiological Psychology","term":"202554","courseNumber":"4230","subject":"PSY","description":"Explores the relationship between brain function and human behavior. Introduces how nerve cells function. Topics include localization of function in the brain, perception, learning, eating behavior, motivation, and the relation of emotion to nervous system activity.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20234","seatCapacity":30,"seatRemaining":25,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Riberdy, Anne"}]},{"name":"Personality","term":"202554","courseNumber":"4310","subject":"PSY","description":"Focuses on behavioral, dynamic, and constitutional determinants. Includes concepts such as environmental and genetic contributions, assessment of personality, research, and a survey of the major personality theories.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20048","seatCapacity":30,"seatRemaining":18,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Leary, Kerry"}]},{"name":"Advanced Practicum 1","term":"202554","courseNumber":"4600","subject":"PSY","description":"Offers students an opportunity to apply behavioral principles and methods within organizational settings. Students engage in agency settings to bolster and demonstrate professional competencies needed to serve individuals, groups, organizations, and communities in our global 21st century.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20236","seatCapacity":20,"seatRemaining":4,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Leary, Kerry"}]},{"name":"Senior Research Seminar in Psychology","term":"202554","courseNumber":"4850","subject":"PSY","description":"Offers students an opportunity to independently investigate a topic of interest and present their findings to their peers. This capstone course for the undergraduate curriculum should be taken as close as possible to graduation.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Capstone Experience"," NUpath Writing Intensive"],"sections":[{"crn":"20196","seatCapacity":30,"seatRemaining":23,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Leary, Kerry"}]},{"name":"Introduction to Sociology","term":"202554","courseNumber":"1100","subject":"SOC","description":"Examines the basic theoretical perspectives, research methods, and concepts of sociology, including society, culture, institutions, status and role, socialization, social groups, and the role of the individual within society. &#160;Considers a number of specific topics to help explore these concepts, including crime, deviance, sexualities, gender, education, and the environment.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Societies/Institutions"],"sections":[{"crn":"20078","seatCapacity":30,"seatRemaining":18,"waitlistCapacity":10,"waitlistRemaining":10,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Igo, Patricia"}]},{"name":"Sociology of Boston","term":"202554","courseNumber":"1210","subject":"SOC","description":"Examines Boston from the perspective of environmental development, neighborhood and intergroup relations, institutional services, and symbolic meanings. The city is a laboratory for exploring the people&#8217;s search for a lifestyle and the satisfaction of their needs. Offers students an opportunity to learn about urban sociology by using Boston as the case study. Examines the social history and historical development of contemporary Boston and analyzes selected current sociological issues.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Difference/Diversity"," NUpath Societies/Institutions"],"sections":[{"crn":"20049","seatCapacity":25,"seatRemaining":20,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Ryder Hall","room":"158","days":[2],"startTime":1750,"endTime":2020,"final":false,"finalDate":null}],"faculty":"Miller, Edward"}]},{"name":"Engaging Difference and Diversity","term":"202554","courseNumber":"1220","subject":"SOC","description":"Introduces the issue of diversity in the United States and across the globe. All humans share the same basic capacity for thinking, feeling, and social and moral reasoning. This general capacity takes specific cultural shape as each group adapts to different environments and historical situations and over time constructs a cultural tradition. Offers students an opportunity to articulate this knowledge intellectually and to apply it to everyday living and practices.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Difference/Diversity"," NUpath Interpreting Culture"],"sections":[{"crn":"20050","seatCapacity":30,"seatRemaining":16,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Lank, Shannon"}]},{"name":"Race and Ethnicity","term":"202554","courseNumber":"1230","subject":"SOC","description":"Examines race and ethnicity as constructed differences. Explores the reasons for their existence, the power dynamics behind constructions of difference, the impact of difference on identity, and ways that visual and other presentations influence perceptions of self and others. Because human beings belong to different racial and ethnic groups, the study of these constructs is important to sociology. Explores the history of race and ethnicity and how history has influenced the study of these topics.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Difference/Diversity"," NUpath Interpreting Culture"],"sections":[{"crn":"20051","seatCapacity":30,"seatRemaining":22,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Mohan, Sabrina"}]},{"name":"Popular Culture","term":"202554","courseNumber":"2100","subject":"SOC","description":"Explores the significance of expressions of popular culture such as film, television, music, and literature. Examines media production, organization, technology, and audience consumption. Discusses countercultures and subcultures, moral and ethical considerations, high and low culture, independent and corporate business influences, and consumerism and consumption. Topics include the effects of popular culture on race, gender, and class. Covers the relationship between popular culture and existing socioeconomic institutions.","maxCredits":3,"minCredits":3,"nupath":[" NUpath Interpreting Culture"],"sections":[{"crn":"20052","seatCapacity":30,"seatRemaining":25,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Boston","meetingTimes":[{"building":"Ryder Hall","room":"157","days":[2],"startTime":1750,"endTime":2020,"final":false,"finalDate":null}],"faculty":"Lank, Shannon"}]},{"name":"Drugs and Society","term":"202554","courseNumber":"2200","subject":"SOC","description":"Introduces the sociology of drugs. Examines social definitions of licit and illicit drugs, conditions of their use, and socialization into drug use. Surveys deviant drug use and the effects of social control on definitions and use of drugs. Applies the relevant sociological theories of deviance and social control.","maxCredits":3,"minCredits":3,"nupath":[],"sections":[{"crn":"20053","seatCapacity":30,"seatRemaining":23,"waitlistCapacity":5,"waitlistRemaining":5,"classType":"Lecture","honors":false,"campus":"Online","meetingTimes":[{"building":"","room":"","days":[],"startTime":null,"endTime":null,"final":false,"finalDate":null}],"faculty":"Mulvey, Kevin"}]}],"subjects":["ACC","AVM","ALY","ART","BIO","BTC","CHM","CMN","CET","CS","ECN","EET","ENG","FIN","GET","HMG","HSC","HST","HRM","HSV","ITC","INT","LDR","MGT","MKT","MTH","MET","PHL","PHY","PJM","PSY","SOC"]}